[
  {
    "moduleCode": "GEH1001",
    "title": "Globalisation and New Media",
    "description": "This module offers students an introduction into the role of new communication technologies in the context of globalization. We will explore various aspects of global communication flows including the global reach of new media and its consequences, global and transnational timesharing and workflows, the role of new media in global and local politics, and the potential of new and traditional communication channels in the context of various forms of activism and communication for social change. The role of culture in global communication and ways in which cultural processesshape and are shaped by the landscape of globalization will be emphasized.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEM1036",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-05T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1002",
    "title": "Economic Issues in Dev World",
    "description": "This module aims to highlight the major economic problems that characterize the present-day developing countries with special reference to ASEAN and East Asian NIEs. While the problems and issues are brought out in a non-technical fashion, the relevant policies are discussed with the help of appropriate empirical evidences so as to allow the students to gauge the extent of success achieved by various policies. The course is likely to impart useful knowledge and information on the prime development issues that concern the developing world today. After the successful completion of the module, students should be able to identify the main problems that are currently faced in Asia and would be able to make some policy suggestions in dealing with these problems. They will also gain some useful experience on the economic development of Singapore.",
    "moduleCredit": "4",
    "department": "Economics",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEM1018K, GEK1018",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1004",
    "title": "Chinese Heritage: Hist & Lit",
    "description": "The module aims to provide a general understanding of traditional China by focusing on two important aspects of its civilization: history and literature. In the first half of the semester, students will be introduced to the major political, intellectual, and social developments in the various dynasties of imperial China.  In the second half of the semester, the module calls attention to the major literary genres that dominated each historical period, from the pre-Qin era through the Tang dynasty.  In so doing, we offer students an overview of what formed the cornerstone of the civilization of traditional China. (This module is taught in English.)",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1007",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEH1006",
    "title": "Chinese Music, Language and Literature (in English)",
    "description": "This course explores the complex relationships underlying Chinese music, language and literature. It focuses on Chinese music from the perspective of popular music produced in the People’s Republic of China, Hong Kong, Taiwan and Singapore. These four economies have developed different strands of popular music in Mandarin and various Chinese dialects, due to different linguistic and ideological environments. Students will learn how Chinese popular music draws upon the aesthetics of Chinese literature and traditional Chinese music, and how the music has hybridised influences from foreign musical genres, thus expressing different versions of “Chineseness”.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1053",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1008",
    "title": "Nations & Nat'lisms in S Asia",
    "description": "This module examines the role which nationalism has played in the formation and political development of the nations and states of South Asia.  It examines nationalist forces in anti-colonial struggles, in post-colonial state formation and in contemporary political developments.  It will be of relevance to students with an interest in political developments in Asia, with particular reference to forms of nationalism and nation-building",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1035",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1009",
    "title": "Framing Bollywood: Unpacking The Magic",
    "description": "Bollywood Cinema is recognised as the most vibrant form of cultural media in India, one whose influence now extends to many parts of the world. By studying the content and meaning of selected Bollywood films, this module will introduce students to key social, economic, political and cultural issues in India, and\nexplore important concepts in the humanities and social sciences such as nationalism, gender and sexuality, diaspora and globalisation.",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEM1050",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-01T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-27T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 4
      }
    ]
  },
  {
    "moduleCode": "GEH1010",
    "title": "Beasts, People and Wild Environments in South Asia",
    "description": "How do ideas about big beasts and the wild inform our socio‐cultural worldview? In other words, what is a “tiger” when it is not just a zoo animal but one that lives in a forest next to your home? In this introductory and interdisciplinary course to conservation and the environment, we will watch films and discuss novels and ethnographies focusing on human/animal relations in six different spheres: Mountains, Deserts, Rivers, Plains, Forests, and Sea. The course aims to be an informative, provocative and fun introduction to an exciting and relatively new field of scholarship.",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      0,
      3,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEM1913",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-04T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1013",
    "title": "Pirates, Oceans and the Maritime World",
    "description": "Piracy, understood broadly as violence or crime at sea, is a present day phenomenon and yet one which has a history spanning centuries and across all the oceans of the world. From pirates to privateers, corsairs to raiders, maritime predators take various names and forms. This module explores the history of pirates and piracy. By examining case studies from the 1400s onwards and by placing pirates into the context of oceanic history and maritime studies, students will be able to demystify the popular images often associated with pirates.",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      3,
      1,
      0,
      4,
      2
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEK2049",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-04T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1014",
    "title": "Samurai, Geisha, Yakuza as Self or Other",
    "description": "This module challenges the foundation of human knowledge. Examining cultural icons from Japan's past and present we will unpack the assumptions, stereotypes, narrative strategies, and visualizing techniques of representing Japan. Students will probe one or more of Japan's three famous cultural icons - the samurai, the geisha, and/or the yakuza - as they appear in literature, visual and performance arts, and academic writings. By the end of the module students will not only have a richer understanding of the 'realities' behind such icons, but more significantly, they will be equipped to challenge stereotypes of Japan presented by journalism, popular culture, and the humanistic and social sciences.  Ultimately such discovery will lead students to question their own knowledge of self and other. Students should refer to the module IVLE page for details of the selected icon(s) for the current semester.",
    "moduleCredit": "4",
    "department": "Japanese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,    
    "preclusion": "GEK2022",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEH1015",
    "title": "Cultural Borrowing: Japan and China",
    "description": "Humans have always actively borrowed from other cultures. Such borrowing is a creative process which influences aspects of life ranging from basic material\nneeds to aesthetic appreciation. Often, however, cultural borrowing is labelled as simple imitation. This results in cultural stereotypes that impede understanding of other cultures. Using Chinese and Japanese cultural borrowings as illustration, this module teaches second and third year students to analyze the creative process of cultural exchange. By developing theoretical perspectives from the study of China and Japan, students will learn about exchanges among culture in general.",
    "moduleCredit": "4",
    "department": "Japanese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEK2042",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEH1018",
    "title": "A Brief History of Science",
    "description": "Nowadays it is all too easy to take basic science laws and theories, such as Newtons law of gravitational attraction or evolution for granted. The impact of research breakthroughs on society at the time of their development is being forgotten, as they come to be taken for granted. Even Science students tend to be unaware of how modern concepts have arisen, what their impact was at the time and how they changed the world. This course is intended to explain the history and significance of scientific developments on societies and how perceptions of the world have changed as a result.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1539",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-08T09:00:00.000Z",
        "examDuration": 90
      }
    ]
  },
  {
    "moduleCode": "GEH1019",
    "title": "Food & Health",
    "description": "This module will examine the current thinking and information as regards the importance of diet and health. It will explore traditional and more modem views on what constitute an adequate and healthy diet. The composition of food along with potential contaminants of food will be examined and how an individual needs to consider their diet in relation to specific needs. The aim will be to educate the students on the need for and the composition of a healthy diet and how to obtain this and remain healthy during the important years of development in early adulthood. There is now much more emphasis on the role of food in preventative medicine and how a well balanced diet can keep one fit and healthy. It is necessary to be aware of the composition of various foods and how different methods of processing and cooking may affect the compositional quality of the product.",
    "moduleCredit": "4",
    "department": "Chemistry",
    "faculty": "Science",
    "workload": [
      2,
      0,
      0,
      5,
      3
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEK1529 and GEM1908",
    "attributes": {
      "su": true,
      "ssgf": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-27T01:00:00.000Z",
        "examDuration": 90
      }
    ]
  },
  {
    "moduleCode": "GEH1022",
    "title": "Geopolitics:Geographies of War & Peace",
    "description": "GE 1022 K (GEOPOLITICS) is an exciting introduction to the world of practical, formal and popular geopolitics via numerous case studies and multi-media presentations. The basic aim is that each of you will become familiar with the world political map and the relevance of geopolitics as ways of understanding and seeing our world. The Geopolitics module provides an engaging way to integrate aspects of modern history with political geography, for instance through the analysis of nationalisms and territorial disputes (in different parts of the world); through the study of the Cold War in relation to changing political landscapes in Southeast Asia; and through more contemporary understandings of the global geopolitics associated with the so-called War on Terror; and global issues of ecological security and environmental geopolitics.",
    "moduleCredit": "4",
    "department": "Geography",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEK1022",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-30T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1023",
    "title": "Exploring Chinese Cinema: Shanghai‐Hong Kong‐Singapore",
    "description": "Studies on cinema offer an important perspective for understanding human cultures. This course explores Chinese-language film history from the 1930s to the present through examining some key genres of films made by major filmmakers from China, Hong Kong, Singapore and Taiwan, including opera, musical, action and youth films. Special attention will be paid to the socio-cultural condition of their production, distribution, exhibition and consumption, as well as larger regional cultural connections of these four places. The course will be taught in English.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK2047, CH2297",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1025",
    "title": "Global Environmental Issues",
    "description": "GEK1522 is an interdisciplinary module that brings together perspectives from different disciplines to provide deep insights into known and emerging global environmental issues and to develop polcies for achieving environmental, economic and social sustainability in a holistic manner. Given the scope of the module and its educational outcomes, the module draws students from diverse disciplines within NUS including \"Law\", \"Business\" and \"Computing\", etc. The key strength of the module is its diversity in terms of disciplinary composition. To take advantage of this diversity, the module promotes \"collaborative learning\" through peer teaching & learning by dividing the large class (120 to 130 students) into multi-disciplinary teams of 5 students.  The instructor assigns reading materials to individual teams on broad topics that cut across human society and culture.",
    "moduleCredit": "4",
    "department": ["Civil Engineering", "Environmental Engineering"],
    "faculty": "Engineering",
    "workload": [
      2,
      1,
      0,
      1,
      2
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEK1522",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-28T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1025T",
    "title": "Global Environmental Issues",
    "description": "GEH1025T is an interdisciplinary module that brings together perspectives from different disciplines to provide deep insights into known and emerging global environmental issues and to develop polcies for achieving environmental, economic and social sustainability in a holistic manner. Given the scope of the module and its educational outcomes, the module draws students from diverse disciplines within NUS including \"Law\", \"Business\" and \"Computing\", etc. The key strength of the module is its diversity in terms of disciplinary composition. To take advantage of this diversity, the module promotes \"collaborative learning\" through peer teaching & learning by dividing the large class into multi-disciplinary teams of 5 students. The instructor assigns reading materials to individual teams on broad topics that cut across human society and culture.",
    "moduleCredit": "4",
    "department": "Environmental Engineering",
    "faculty": "Engineering",
    "workload": [
      2,
      1,
      0,
      1,
      2
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEK1522, GEK1522T, GEH1025",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-11T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 3,
        "examDate": "2019-07-13T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1026",
    "title": "Drugs and Society",
    "description": "The aim of this module is to impart an appreciation of the use of drugs in relation to the cultural and social environment of societies past and present. How drugs are employed today, watershed \"drug\" discoveries and their impact on society (for example contraceptives, antibiotics, vaccines, psychopharmacological agents), the issue of drug use in sports, \"social\" drugs and the \"pill for every ill\" syndrome will be discussed. Particular attention will be paid to “controversial” drug-related societal issues within each topic. For example, the role of pharmaceutical industry will be examined to determine if the tendency to  “bash” big Pharma is justified or if decriminalization of drug use will be a more effective means of curtailing drug abuse. One of the components in this module requires students to objectively evaluate such issues and articulate their stand in an audio-visual presentation.",
    "moduleCredit": "4",
    "department": "Pharmacy",
    "faculty": "Science",
    "workload": [
      3,
      1,
      0,
      1,
      5
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEK2506",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-29T09:00:00.000Z",
        "examDuration": 90
      }
    ]
  },
  {
    "moduleCode": "GEH1027",
    "title": "Einstein's Universe & Quantum Weirdness",
    "description": "Einstein's Ideas of our Universe and his Quantum contributions has greatly impacted the human societies.  Students will also be enthused with the historical and philosophical development of Relativity and Quantum Theories. Einstein's relativistic thinking eventually leads to the creation of navigational systems that are used in transportation and communication, both by the military as well as hand phone consumers. The construction of nuclear plants is made possible by the relativistic results of mass and energy conversion. Einstein's Photoelectric discoveries also pave the way for modern cameras in the ubiquitous mobile devices. The quest for new quantum particles at the colliders by huge collaborations among many countries gave birth to the World Wide Web and the internet Culture.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1508",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1028",
    "title": "The Emerging Nanoworld",
    "description": "This module will acquaint students with the rapid development of the nanoworld with insights into the impact of this emerging technology on our society, environment and human life. The essence of nanoscience and technology lies in the understanding and manipulation of molecules.  The advances in these fields are expected to significantly influence our lives in the spheres of medical, engineering, ethical and environmental issues. This module will discuss the potential benefits and challenges of novel nanotechnologies. How does nanotechnology affect society and human interaction?  How will nanodevices and nanomaterials change our lives in the future?",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1509",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1030",
    "title": "Science of Music",
    "description": "This module aims to establish clear relationships between the basic elements of music found in virtually all musical cultures and their underlying scientific and mathematical principles. Musical scales which are the foundation of western musical culture as well as many other musical cultures will be discussed, with their evolution viewed from both western and non-western perspectives. The scientific and technical basis for the development of musical instruments of different musical cultures such as the piano, as well as their acoustical characteristics, will be examined. The module also looks at contemporary technologies in music such as digitization which has profoundly affected how the music of virtually all musical cultures is propagated.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "projects": false,
    "webcasts": false,
    "preclusion": "GEK1519",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEH1032",
    "title": "Modern Technology in Medicine and Health",
    "description": "The human race has entered an epoch where life span has increased significantly. During the twentieth century, life span has increased from around 50 to over 75 years mainly due to antibiotics, vaccinations, and improved nutrition. However this increase in lifespan has brought to the forefront a rise in many age-related diseases. These diseases, which include cancer, heart disease, Alzheimer’s disease, Parkinson’s disease, are now a focus of health care in the 21st century. This course describes many of these diseases, and their diagnosis and treatment using advanced technology found in modern hospitals. The course also provides an insight into the scientific principles underlying these new and powerful technologies.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEK1540",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-07T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1033",
    "title": "How the Ocean Works",
    "description": "About three-quarters of the surface of our home, the Earth, is covered by an ocean of water! The ocean is inseparably intertwined with human settlements. Day in, day out, directly, indirectly - from the air that we breathe to climate change, trade, politics or social holidays - the presence and the influence of the ocean is undeniable on the human society. We will discuss how the ocean is connected to our lives, how the various ocean phenomena affect our lives and our attempts at controlling and exploiting the ocean. Students will gain an appreciation of the scientific principles involved. This course will also help us make educated decisions about our environment and our ocean, so that future generations may also enjoy the majesty of our blue planet, as we do now.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      3,
      1,
      0,
      0,
      6
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEK1548,GEK1548FC",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1034",
    "title": "Clean Energy and Storage",
    "description": "Modern civilization, which on the one hand boasts of having discovered the behaviour of subatomic particles, has also to its credit the impending intensified energy crisis and global warming. The urgent need to address these challenges has now become obvious. The course will acquaint students with the role of scientific development towards understanding the current global energy crisis and global warming. Emphasis will be given on how scientific progress has helped us in understanding the principle and development of various clean energy and storage technologies, their potential and applicability in present day scenarios and in shaping future energy systems.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "projects": false,
    "webcasts": false,
    "preclusion": "GEM1535",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEH1035",
    "title": "Phy'cal Qns from Everyday Life",
    "description": "This module demonstrates the application of physical science to everyday situations besides to excite the curiosity and imagination of the students and bring out their awareness of the many marvels that surround them. Students will develope a deeper knowledge and a greater appreciation towards apparently mundane events of their daily life. Everyday phenomenon relate to physical concepts will be discussed in the context to real-world topics, societal issues, and modern technology, underscoring the relevance of science and how it relates to our day-to-day lives. During the module, students will select and discuss their own apparently mundane event and present their topic accordingly.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEM2507",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1036",
    "title": "Living with Mathematics",
    "description": "The objective of this course is to exhibit some simple mathematical ideas that permeate a modern society and to show how a reasonably numerate person can use these ideas in everyday life and, in the process, gain an appreciation of the beauty and power of mathematical ideas. For example, we will learn some counting methods that can be applied to the enumeration of bus routes in a model of a grid system of roads in a city. We will also investigate some basic properties of graphs, which are mathematical structures used to model relationships between people in social networks, groups, organizations, computers, URLs etc. Transmission of digital information and signals is now an integral part of modern society. We will look at questions like: How do we encode information so that certain errors in transmission can be detected, or even corrected? How do we check that a given sequence of numbers is a proper International Standard Book Number (ISBN)? How do we encrypt sensitive information like credit card numbers using properties of prime numbers? Finally, we will examine some basic ideas in probability which are often at the basis for making decisions and judgement in the real world with random outcomes and measurements.",
    "moduleCredit": "4",
    "department": "Mathematics",
    "faculty": "Science",
    "workload": [
      3,
      1,
      0,
      3,
      3
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEK1505",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1040",
    "title": "Exploration in Musical Production",
    "description": "This module engages students to think and express themselves through the production process of a musical. By introducing the various aspects of mounting a musical production, it empowers the students to transmit this understanding into an actual display of intrinsic ideas. The module will be executed through classroom seminars and an experiential component culminating in the form of a micro-musical. The content coverage embodies a survey and appreciation of Singapore musicals; and to expound on the hardware and software requirements in mounting a musical. This include individual elements like acting, singing, writing, composing, music-making and dancing which are interwoven in the creation of this art form; as well as the financial and budget planning, safety measures and basic aspects of stage management.",
    "moduleCredit": "4",
    "department": "Music",
    "faculty": "YST Conservatory of Music",
    "workload": [
      0,
      3,
      0,
      5,
      2
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1065",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1043",
    "title": "Microbes which Changed Human History",
    "description": "The primary aim of the module is to introduce students to the nature of infectious diseases and their impact on human activities.  At the end of the module, students will be able to understand the interactions between microorganisms and human, and the position and role of human in the living world.",
    "moduleCredit": "4",
    "department": "Medicine",
    "faculty": "Yong Loo Lin School (Medicine)",
    "workload": [
      2,
      2,
      0,
      3,
      3
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1534",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1044",
    "title": "Understanding Globalisation",
    "description": "This module proposes to examine the processes of globalization and seeks to provide a deeper understanding of it. The world is globalizing both culturally and economically. We need to ask whether this process is creating a single world without borders or intensifying cultural differences between societies. By discussing various trends of the interdependent world, the course helps us in understanding the various processes of globalization. Since the processes of globalization involve societal, cultural, technological, political, and economic processes, we will take an inter-disciplinary framework in understanding this diverse experience. The course will specifically highlight the problems and prospects of the contemporary world",
    "moduleCredit": "4",
    "department": "Sociology",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEK1041",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-29T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1045",
    "title": "World Religions",
    "description": "This course offers an introductory survey of major religious traditions of the world, with specific Page 12 of 141 focus on Hinduism, Buddhism, Confucianism, Daoism, Judaism, Christianity, and Islam. We will examine the historical development of each tradition, along with its sacred texts, basic philosophical\nideas, patterns of ritual and worship, and specialized institutions Our goal is to provide an objective understanding of each faith tradition on its own terms, and secondarily, to explore how religion is relevant to contemporary social, political and cultural issues. This is an introductory course which presumes no prior expertise in religious studies.",
    "moduleCredit": "4",
    "department": "Southeast Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1045",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-02T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1047",
    "title": "Social and Cultural Studies through Music",
    "description": "This module provides a cross-cultural introduction to music both as an art and as a human, socio-cultural phenomenon. Through lectures, reading and listening assignments, and actually playing different styles of music, students will learn how music works, why people listen to and make music, what its roles are in a society, and how these things vary in different cultures. The module introduces a variety of musical styles and cultures that represent an enormous wealth of human experience. At the end of the course the students will have access to a much wider variety of music to listen to, participate in, enjoy, and understand.",
    "moduleCredit": "4",
    "department": "Music",
    "faculty": "YST Conservatory of Music",
    "workload": [
      2,
      0,
      2,
      3,
      3
    ],
    "projects": false,
    "webcasts": false,
    "preclusion": "GEK1054",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1049",
    "title": "Public Health in Action",
    "description": "From the global increase in obesity to SARS, a range of health issues and solutions will be explored in differing contexts throughout the world. Working in small groups, students debate and evaluate paths to addressing global health issues in a variety of cultural contexts. For example, lessons learned about tuberculosis in Russia may be applied to the Singaporean context, or students may examine efforts to prevent newborn deaths in developing nations. Students will develop an appreciation of how the health of an entire population impacts individuals and how complex problems can be prevented or addressed using culturally appropriate solutions.",
    "moduleCredit": "4",
    "department": "Medicine",
    "faculty": "SSH School of Public Health",
    "workload": [
      0,
      3,
      0,
      3,
      4
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEK1900",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1050",
    "title": "Plants and Society",
    "description": "How are human beings and plants interdependent? How did plants shape the planet Earth to one that is suitable for life as we know it? Such topics will be examined to deepen our appreciation of the roles played by plants in the progress of civilizations and cultures from both historic perspective and continuing impact on society. The discussion topics, written and oral presentations will include plants as sources of food, clothing, shelter, medicine. There will be talks by guests from local industry, along with team projects by students to enrich their awareness of the deep coexistence of plants and society.",
    "moduleCredit": "4",
    "department": "Biological Sciences",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1538",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-09T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1051",
    "title": "Narrative",
    "description": "In this module, students will learn the basic concepts of narrative. It will expose them to narrative as a basic idea that runs through their lives, and which has its most sophisticated manifestations in literature and cinema. While the analysis of literary and cinematic texts will play an important part in the module, students should also develop an awareness of how narrative is used in everyday discourse, and how it shapes their response to reality.",
    "moduleCredit": "4",
    "department": ["English Language", "English Literature"],
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK1049",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1053",
    "title": "Film Art and Human Concerns",
    "description": "Can movies engage with serious concerns? Through the close study of films by great directors, this module explores how film as an artistic medium can be used to engage with significant socio-cultural and existential concerns. Students will be taught how to analyze film as an artistic medium and, further, how film directors use the aesthetic elements of film to engage with important subjects. Through films by directors like Stanley Kubrick, Orson Welles, Wong Kar-Wai and Zhang Yimou, students get a chance to reflect on issues like the human condition, the family, the urban condition, love and society, and the nation.",
    "moduleCredit": "4",
    "department": ["English Language", "English Literature"],
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEK2020",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1054",
    "title": "Names as Markers of Socio-cultural Identity",
    "description": "This module focuses on names as a means of marking out the socio-cultural identity of the named and of the namer. Attention will be paid to anthroponyms (personal names), toponyms (place names) and commercial names. This module will be interdisciplinary in nature and will combine a range of approaches to names. Linguistic and philosophical approaches will provide the theoretical anchor to the topic of names. Subsequent seminars will contextualise names in their historical, geographical, political and literary contexts. There will be scope for students to develop the module in the direction of their interests in the mini project.",
    "moduleCredit": "4",
    "department": ["English Language", "English Literature"],
    "faculty": "Arts and Social Science",
    "workload": [
      0,
      3,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEM1031",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-04T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1055",
    "title": "Religion and Film",
    "description": "Cinematic and literary expression centred on religious topics can be studied to see how the vitality of cultural expression and power of the religious imagination interrelate. No prior training in artistic interpretation or religious history is required, though the module presumes a curiosity about religion and culture. It trains students to think about why people sometimes enjoy seeing films about painful topics. It clarifies the difference between “studying” and “practising” religion, and it teaches students to discuss controversial topics with tact.",
    "moduleCredit": "4",
    "department": ["English Language", "English Literature"],
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEM1033",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-03T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1056",
    "title": "Cultural Diversity in the Contemporary World",
    "description": "This GE module introduces the diversity of human cultural experience in the contemporary world. It offers an anthropological lens for understanding cultural diversity with concrete cases. We will read articles and analyse ethnographic films on kula exchange, cannibalism, oracle, feud, animism, sacrifice, initiation, incest, spirit-possession, statelessness, potlatch, genocide, and so on, found in Melanesia, Amazonia, sub-Sahara, Siberia, Zomia, South Asia, and Southeast Asia. We will gain a sensitivity toward stereotypes and ethnocentrism, understand the connections and processes that shape social life at different levels, and learn the skills to appreciate and analyse differences in the changing world.",
    "moduleCredit": "4",
    "department": "Sociology",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "projects": false,
    "webcasts": true,
    "preclusion": "GEK1005",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-29T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1057",
    "title": "Materials: The Enabling Substance of Civilization",
    "description": "The module addresses the key roles of enabling materials in driving the sweeping changes of human history and the rapid development of civilization, technology and society. This module will examine, from the Stone Age to the 21st century, how the different types of enabling materials were discovered, became available to the general people, completely transformed their lives, and consequently shaped the entire course of our civilization. This module will also highlight the latest advances in materials, their uses in our daily lives and future sustainable development, such as IT, iPhones, Boeing 787, Airbus A380, energy-saving buildings and smart transport.",
    "moduleCredit": "4",
    "department": "Materials Science and Engineering",
    "faculty": "Engineering",
    "workload": [
      4,
      0,
      0,
      1,
      5
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-30T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1058",
    "title": "The Theatre Experience",
    "description": "While many of us spend much of our lives glued to small computer screens, theatrical productions continue to bring people together for shared experiences. What are the attractions of theatre, what makes it distinct, and how can it enrich our understanding of human society? This module, which requires no prior knowledge of theatre, starts with the spectator’s experience and works outwards. We learn how to analyse theatre’s styles and effects. We explore how human societies use theatre to confront questions and express beliefs, hopes, and anxieties. We examine how cultures influence each other through theatre, and how theatre provokes change.",
    "moduleCredit": "4",
    "department": ["English Language", "English Literature"],
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "GEK1055",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1060",
    "title": "Social History of the Piano",
    "description": "An interdisciplinary study of how societies and different generations responded to the invention of the piano. This module focuses on the social history of the piano throughout the past three centuries, canvassing a wide array of performers, composers, supporters, manufacturers, “heroes”, politicians, teachers and students. Various expressions of ideologies from differing periods eventually revolutionized and efffectuated the versatility of the piano, shaping a legacy which led to the “globalization” of the piano, including China. Students will learn through lectures, readings, discussions, listening, playing, and attending piano recitals and masterclasses.",
    "moduleCredit": "4",
    "department": "Music",
    "faculty": "YST Conservatory of Music",
    "workload": [
      1,
      1,
      0,
      4,
      4
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1061",
    "title": "Representation and Media",
    "description": "The module introduces the basic concepts in representations of gender, politics, celebrities and culture, and otherness. Concepts that will be examining in this module include representation, structuralism, and feminism. The module will examine and analyse the basic idea of representation, celebrity and culture, gender, politics and otherness; and how media portray them.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-28T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-08T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1062",
    "title": "Ghosts and Spirits in Society and Culture",
    "description": "Ghosts  and  spirits  have  been  subjects  of  perennial interest in different human societies. At the same time, beliefs  about  persons  with  powers  to  initiate  injury  or  good,  and  their  relationship  with  spirits  are  found  in  almost all cultures   throughout   human   history.   This module  introduces  students  to  the  scholarly  study  of  ghosts  and  spirits,  and  the  specialists  and  practitioners  involved  with  these  forces.  These  include  shamanism,  spirit  possession,  witchcraft  and  sorcery,  and  other  supernatural  entities  such  as  zombies,  vampires  and  werewolves,  and  how  these  intersect  with  issues  of  class,  gender,  sexuality,  ethnicity,  citizenship,  popular  culture, modernity and social change.",
    "moduleCredit": "4",
    "department": "Sociology",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": true,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-04T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1063",
    "title": "Understanding Body, Mind and Culture through Sport",
    "description": "In the contemporary society, sports are closely linked to larger issues such as health, fitness, physical appearance, money, politics, and cultural values.  This module draws on physical, psychological and sociocultural knowledge and complements it with required practical and experiential learning to provide students with a grounded appreciation of sports and related issues.  It discusses the recent rise of marathons, iron man races, and cycling.  It also confronts controversial issues pertaining to the use of substances to improve performance and motivation to attain the desired body image. Finally, it questions how these are linked to societal and cultural expectations.",
    "moduleCredit": "4",
    "department": "Medicine",
    "faculty": "Yong Loo Lin School (Medicine)",
    "workload": [
      2,
      0,
      1,
      5,
      2
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1065",
    "title": "Art in Society",
    "description": "In this module students will learn that art does not exist apart from society. What is considered art is determined by ideas within a particular time period and social institutions. Furthermore, art is not only about the artist. As a social activity, art making involves elaborate cooperation among specialised personnel. Giving focus to visual art and using examples from Southeast Asia\nand beyond, topics covered include gender in the arts; governments, economies and religion in shaping the arts; artists and their art making as well as social dimensions of aesthetic experience and interpretation of art works.",
    "moduleCredit": "4",
    "department": "Malay Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": true,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1067",
    "title": "Superhero Entertainments",
    "description": "This module examines the social and cultural significance of superhero entertainments. Particular attention is paid to the origins of superheroes in comic books and the manner in which the major two companies, DC and Marvel, positioned those heroes in blockbuster movies commencing with Superman in 1978. The module traces the antecedents of comic book\nsuperheroes, discuss their various incarnations in other media forms like radio and television, and culminates in a discussion of the wave of recent superhero films. The module will also cover some of the strategies companies have adopted in licensing and marketing their superheroes.",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": false,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-02T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1068",
    "title": "The Life Aquatic: Machines and the Making of the Ocean",
    "description": "Oceans cover most of the globe. Yet once we venture from  the   shore, our  understanding  of  the  marine environment  is  necessarily  mediated  by  technology, from  the  plumb  line  used  by  sailors  for  millennia  to measure  the  water’s  depth,  to  the  latest  satellite imaging  tracking  ocean  currents  in  real  time.  This module    examines    how  different  “machines,”  or technologies  have  produced  understandings  of  the ocean across history, and places these technologies in their social, cultural, economic, and political contexts. The   result   is   to   reveal   the   complex   and   evolving interconnections that link technology, and society and our understanding of the natural world.",
    "moduleCredit": "4",
    "department": "Southeast Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEH1069",
    "title": "Art in Asia: Through Media, Style, Space and Time",
    "description": "This  course  provides  a  thematic  introduction  to  the major religious, traditional and decorative arts of Asia. Through a study of important architectural monuments, key works of art, materials and processes, students  will  explore  the  shared  cultures,  aesthetics and artistic achievements of India, China and Southeast Asia  and  how  the  visual  arts  of  Asia  were  shaped  by religious,   imperial,   political,   economic,   and   social climates from its early civilizations to the modern era.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEH1070",
    "title": "Traditional Chinese Knowledge of Health and Well-being",
    "description": "The  module  offers  NUS  students  an  opportunity  to explore traditional Chinese concepts of well-being and health through a general survey of Chinese beliefs and medical    culture    in    its    dynamic    formation    and transformation, and its influence in East Asian medical tradition.  The  various  topics  include  Confucian  and Taoist ideas of well-being and happiness; the influence of  the  theories  of  Yin-Yang  &  Five  Elements,  Essence (Qi), Meridians (Mai) and Celestial Cycles on traditional Chinese   medicine.   Principles   behind   the   Chinese practices   of   healing,   in   order   to   achieve   physical harmony,  such  as  acupuncture,  massage  (tui  na),  and cupping (ba guan) will also be explained.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": true,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEH1071",
    "title": "Religion in Malay-Indonesian Literary Worlds",
    "description": "Religion has been a major element in literary cultures\nand tradition of the world. Literary worlds comprises of\naesthetical and ideological realms, including agencies\nand institutions. This module focuses on literary tradition\nof the Malay-Indonesian world centering on analyzing\nliterary texts and discourses on religion and literature. It\naims to expose students to how the literary worlds in the\nregion have been influenced by competing Islamic\ntraditions, including pre-Islamic ones. A critical reading\nof the narratives and discourses will point to the poetics\nand politics by social groupings which have appropriated\nliterary mediums to encapsulate their religious thoughts\nand interests.",
    "moduleCredit": "4",
    "department": "Malay Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-06T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1072",
    "title": "Culture in Action",
    "description": "The module introduces students to the world of culture through specific examples. It examines the ways in which the cultural sphere produces value and significance for humans in society. It introduces students to different approaches to understanding culture, and explores the influence of the cultural sphere on both political and personal relations. Students will examine questions about communication, broadcasting, media technology, architecture, and cyberspace. The module also examines the ways in which culture is produced, disseminated, and consumed, i.e., through specific communities and contexts, and through types of popular culture, including film, television, popular fiction, performance, music, and digital culture.",
    "moduleCredit": "4",
    "department": ["English Language", "English Literature"],
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      1,
      6
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-30T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1073",
    "title": "The Art of Chinese Poetry: Past and Present",
    "description": "This module introduces the aesthetics, forms and genres, major themes, representative poets and evolution of Chinese poetry over a span of 3,000 years. It examines the historical background, rationales and linguistic concerns behind the poetic forms, rules and regulations. It reviews how Chinese poets applied metaphors, allusions and imagery to convey their sophisticated feelings, how they considered the relationship between state, society, nature, arts and themselves. It also studies how modern poets, including those from Singapore and North America, used traditional (as well as vernacular) forms to voice their opinions about contemporary socio-political issues.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEH1074",
    "title": "Luck",
    "description": "This module aims to highlight how luck has influenced and still\ninfluences several aspects of the world we live in. From the\nbeginning of the universe, to our present-day lives, to the end\nof the universe, random events beyond anyone’s control\ncontinue to shape our fate. By exploring the various fields that\nluck manifests itself in, the module ultimately delves into the\nintriguingly precarious nature of existence.",
    "moduleCredit": "4",
    "department": "Economics",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": false,
    "webcasts": false,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-09T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEH1075",
    "title": "Life, Disrupted: The Sharing Revolution",
    "description": "The Sharing Economy (a.k.a. Collaborative Consumption or Peer Economy), describes the development of new business models or platforms, through the coordinated exchanges between individuals, that disrupt traditional markets by redefining industry categories, lowering transaction costs, and maximizing the use of scarce resources. We will explore how sharing economy platforms transform the way we live: how we consume, how we work, and how we trust. Finally, we evaluate the policy responses of governments, to mitigate potential threats to our social compact as a result.",
    "moduleCredit": "4",
    "department": "Economics",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "projects": true,
    "webcasts": true,
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-28T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1000",
    "title": "An Introduction to Literary Studies",
    "description": "Human beings are 'tale-telling animals'. We all tell stories, and we all listen to them, read them and watch them. This module looks at the ways in which people tell stories, the kinds of stories they tell, and the meanings those stories generate. It focuses, in particular, upon the telling, and gives special attention to questions concerned with that. Texts include a novel, a play, films, short stories, poems and oral tales.",
    "moduleCredit": "4",
    "department": ["English Language", "English Literature"],
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "prerequisite": "Exempted from NUS Qualifying English Test, or passed NUS Qualifying\nEnglish Test, or exempted from further CELC Remedial English modules.",
    "preclusion": "EN1101E. Students who are majoring in EN, or intend to major in EN should not take GEK1000.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1002",
    "title": "Introduction to Japanese Studies",
    "description": "This module aims to introduce students to the subject of Japanese studies from a multi-disciplinary approach. It has three main components. The first component is humanities, covering art, philosophy, history and literature. The second component is social sciences, which includes sociology,anthropology, politics and economics. The third component is linguistics and language development. Students will learn about the methods and theories the various disciplines contribute to the study of Japan. Audio-visual materials, fieldwork, guest lectures, study tours, projects and debates will supplement lecture and tutorials.",
    "moduleCredit": "4",
    "department": "Japanese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "JS1101E. Students majoring in JS are precluded from taking\nthis module.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-03T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1003",
    "title": "Introduction to Politics",
    "description": "The purpose of this module is to impart a preliminary overview of political science and its sub-fields so that students have a basic orientation of the discipline. It briefly explains the scope and components of each of the four sub-fields (political theory, comparative politics, international relations and public administration) and familiarises students with the major issues and arguments related to power, justice, political culture, national identity, accountability, ethics and world order. It also focuses on key political institutions. The module will be of interest to students across the university who want to gain a basic understanding of politics.",
    "moduleCredit": "4",
    "department": "Political Science",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "PS1101, GEM1003K, PS1101E.  Not for students majoring in PS",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-29T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1005",
    "title": "Cultural Diversity in the Contemporary World",
    "description": "This GE module introduces the diversity of human cultural experience in the contemporary world. It offers an anthropological lens for understanding cultural diversity with concrete cases. We will read articles and analyse ethnographic films on kula exchange, cannibalism, oracle, feud, animism, sacrifice, initiation, incest, spirit-possession, statelessness, potlatch, genocide, and so on, found in Melanesia, Amazonia, sub-Sahara, Siberia, Zomia, South Asia, and Southeast Asia. We will gain a sensitivity toward stereotypes and ethnocentrism, understand the connections and processes that shape social life at different levels, and learn the skills to appreciate and analyse differences in the changing world.",
    "moduleCredit": "4",
    "department": "Sociology",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "preclusion": "GEH1056",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-29T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1007",
    "title": "Chinese Heritage: History and Literature",
    "description": "The module aims to provide a general understanding of traditional China by focusing on two important aspects of its civilization: history and literature. In the first half of the semester, students will be introduced to the major political, intellectual, and social developments in the various dynasties of imperial China.  In the second half of the semester, the module calls attention to the major literary genres that dominated each historical period, from the pre-Qin era through the Tang dynasty.  In so doing, we offer students an overview of what formed the cornerstone of the civilization of traditional China. (This module is taught in English.)",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEH1004",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEK1008",
    "title": "Southeast Asia: A Changing Region",
    "description": "Description Southeast Asia has been described as one of the 'crossroads of the world' - a place where people from many cultural, ethnic and religious backgrounds meet. The intermingling of people, the exchange of ideas and international commerce have been part of Southeast Asian life for centuries. This module surveys the broad currents of conflict, change and continuity across the region from a multidisciplinary perspective. It looks at how Southeast Asian societies and political systems have changed over time in response to the pressures of ecology, colonialism, nationalism, urbanization and globalization. The module also looks at the way ethnic, religious, national and regional identities have been constructed, used and altered over time. The overall objective is to provide students with an introduction to different ways of exploring Southeast Asia and different experiences of living in the region.",
    "moduleCredit": "4",
    "department": "Southeast Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "preclusion": "SE1101E, SSA1202, SS1203SE and GEM1008K. Not for students majoring, or intend to major in SE.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-28T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1011",
    "title": "The Nature of Language",
    "description": "This introductory overview of linguistics aims at equipping students with a solid foundation in the object, methods and goals of the science of spoken language, the prime tool of human communication. Through a principled analysis of patterns of sound, form and meaning at the levels of word, sentence and text, students will gain insight into what it means to say that language is a rule-governed system and an organic whole. The results of this exploration will be useful to those interested in the relationship between language and mind, society and culture.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "prerequisite": "Exempted from NUS Qualifying English Test, or passed NUS Qualifying English Test, or exempted from further CELC Remedial English modules.",
    "preclusion": "EL1101E",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-01T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-30T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1018",
    "title": "Economic Issues in the Developing World",
    "description": "This module aims to highlight the major economic problems that characterize the present-day developing countries with special reference to ASEAN and East Asian NIEs. While the problems and issues are brought out in a non-technical fashion, the relevant policies are discussed with the help of appropriate empirical evidences so as to allow the students to gauge the extent of success achieved by various policies. The course is likely to impart useful knowledge and information on the prime development issues that concern the developing world today. After the successful completion of the module, students should be able to identify the main problems that are currently faced in Asia and would be able to make some policy suggestions in dealing with these problems. They will also gain some useful experience on the economic development of Singapore.",
    "moduleCredit": "4",
    "department": "Economics",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEH1002",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1022",
    "title": "Geopolitics:Geographies of War & Peace",
    "description": "GE 1022 K (GEOPOLITICS) is an exciting introduction to the world of practical, formal and popular geopolitics via numerous case studies and multi-media presentations. The basic aim is that each of you will become familiar with the world political map and the relevance of geopolitics as ways of understanding and seeing our world. The Geopolitics module provides an engaging way to integrate aspects of modern history with political geography, for instance through the analysis of nationalisms and territorial disputes (in different parts of the world); through the study of the Cold War in relation to changing political landscapes in Southeast Asia; and through more contemporary understandings of the global geopolitics associated with the so-called War on Terror; and global issues of ecological security and environmental geopolitics.",
    "moduleCredit": "4",
    "department": "Geography",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEH1022",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1035",
    "title": "Nations & Nationalisms in South Asia",
    "description": "This module examines the role which nationalism has played in the formation and political development of the nations and states of South Asia.  It examines nationalist forces in anti-colonial struggles, in post-colonial state formation and in contemporary political developments.  It will be of relevance to students with an interest in political developments in Asia, with particular reference to forms of nationalism and nation-building",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEH1008",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1041",
    "title": "Understanding Globalisation",
    "description": "This module proposes to examine the processes of globalization and seeks to provide a deeper understanding of it. The world is globalizing both culturally and economically. We need to ask whether this process is creating a single world without borders or intensifying cultural differences between societies. By discussing various trends of the interdependent world, the course helps us in understanding the various processes of globalization. Since the processes of globalization involve societal, cultural, technological, political, and economic processes, we will take an inter-disciplinary framework in understanding this diverse experience. The course will specifically highlight the problems and prospects of the contemporary world",
    "moduleCredit": "4",
    "department": "Sociology",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEH1044",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1045",
    "title": "World Religions",
    "description": "This course offers an introductory survey of major religious traditions of the world, with specific Page 12 of 141 focus on Hinduism, Buddhism, Confucianism, Daoism, Judaism, Christianity, and Islam. We will examine the historical development of each tradition, along with its sacred texts, basic philosophical\nideas, patterns of ritual and worship, and specialized institutions Our goal is to provide an objective understanding of each faith tradition on its own terms, and secondarily, to explore how religion is relevant to contemporary social, political and cultural issues. This is an introductory course which presumes no prior expertise in religious studies.",
    "moduleCredit": "4",
    "department": "Southeast Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "GEH1045",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1048",
    "title": "Gandhi's Life, Thought And Legacy",
    "description": "This module will primarily examine the life and writings of Mohandas Karamchand Gandhi, widely regarded as one of the icons of the twentieth century and one of the principal architects of a free India. The course is meant to not only understand and analyse Gandhi’s thought but also to outline his extraordinary legacy. The course will develop critical thinking and expression of students in two ways. First, it will introduce students to and make them critically engage with Gandhi’s writings and ideas on several issues, including violence and conflict resolution, colonialism, modernity, ethics, science, health and environment. The aim would be to not only expose students to the complexity of Gandhi — the man and his ideas — but to critically interrogate Gandhi and his legacies. Gandhi is particularly suited to such an exercise since he held positions that were often controversial and counter-intuitive, both during his lifetime as well as today.  Second, the students will develop their expression skills, verbal and written, by evaluating Gandhi and his legacy through presentations, take-home assignments and examinations. The students will develop their thinking and expression skills through an analysis not only of texts but also of films and documentaries on Gandhi.",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "GET1009",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1049",
    "title": "Narrative",
    "description": "In this module, students will learn the basic concepts of narrative. It will expose them to narrative as a basic idea that runs through their lives, and which has its most sophisticated manifestations in literature and cinema. While the analysis of literary and cinematic texts will play an important part in the module, students should also develop an awareness of how narrative is used in everyday discourse, and how it shapes their response to reality.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEH1051",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1054",
    "title": "Social and Cultural Studies through Music",
    "description": "This module provides a cross-cultural introduction to music both as an art and as a human, socio-cultural phenomenon. Through lectures, reading and listening assignments, and actually playing different styles of music, students will learn how music works, why people listen to and make music, what its roles are in a society, and how these things vary in different cultures. The module introduces a variety of musical styles and cultures that represent an enormous wealth of human experience. At the end of the course the students will have access to a much wider variety of music to listen to, participate in, enjoy, and understand.",
    "moduleCredit": "4",
    "department": "YSTCM Dean's Office",
    "faculty": "YST Conservatory of Music",
    "workload": [
      2,
      0,
      2,
      3,
      3
    ],
    "preclusion": "GEH1047",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1055",
    "title": "The Theatre Experience",
    "description": "While many of us spend much of our lives glued to small computer screens, theatrical productions continue to bring people together for shared experiences. What are the attractions of theatre, what makes it distinct, and how can it enrich our understanding of human society? This module, which requires no prior knowledge of theatre, starts with the spectator’s experience and works outwards. We learn how to analyse theatre’s styles and effects. We explore how human societies use theatre to confront questions and express beliefs, hopes, and anxieties. We examine how cultures influence each other through theatre, and how theatre provokes change.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEH1058",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1062",
    "title": "Bridging East and West: Exploring Chinese Communication",
    "description": "This module offers NUS students an opportunity to explore different aspects and contexts of Chinese communication. The target audience is English speaking undergraduates with minimal Chinese language proficiency. The various contexts of Chinese communication include advertising, business, the press, social communication, regional usages, pop culture, translations, meaning of Chinese names, codeswitching and the use of Chinese dialects. It is intended to serve as a primer for students interested in these areas of study. A minimum Chinese language proficiency of CLB is required.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GET1002",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEK1064",
    "title": "Psychology in Everyday Life",
    "description": "The module is designed to equip students who are not planning to major in psychology with basic literacy in the discipline. Students will acquire basic understanding of common human experiences, such as sleep, dreams, learning, and memory from a psychological perspective; and apply psychological knowledge to understand some of the common problematic behaviours we encounter, such as forgetfulness, sleep problems, addiction, eating disorders, depression, and mental retardation. Students will also learn about some of the practical issues, such as whether it is beneficial to boost one’s self‐esteem, whether subliminal persuasion works, and how we could find happiness.",
    "moduleCredit": "4",
    "department": "Psychology",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "PLB1201 and PL1101E.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-06T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1067",
    "title": "Life, the Universe, and Everything",
    "description": "This module offers an opportunity to grapple with some of the most enduring challenges to human thought. Our starting point is a conception of ourselves as free and conscious beings equipped with bodies that allow us to observe and explore a familiar external world. Successive lectures investigate alternative conceptions of the human condition, such as ones in which we are unfree, or non-spirituous, or inhabit a world whose fundamental nature is hidden from our view. Different conceptions bear differently on the further question of what we should value and why. Discussion is both argument-driven and historically informed.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "PH1102E, GET1029",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-04T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1505",
    "title": "Living with Mathematics",
    "description": "The objective of this course is to exhibit some simple mathematical ideas that permeate a modern society and to show how a reasonably numerate person can use these ideas in everyday life and, in the process, gain an appreciation of the beauty and power of mathematical ideas. For example, we will learn some counting methods that can be applied to the enumeration of bus routes in a model of a grid system of roads in a city. We will also investigate some basic properties of graphs, which are mathematical structures used to model relationships between people in social networks, groups, organizations, computers, URLs etc. Transmission of digital information and signals is now an integral part of modern society. We will look at questions like: How do we encode information so that certain errors in transmission can be detected, or even corrected? How do we check that a given sequence of numbers is a proper International Standard Book Number (ISBN)? How do we encrypt sensitive information like credit card numbers using properties of prime numbers? Finally, we will examine some basic ideas in probability which are often at the basis for making decisions and judgement in the real world with random outcomes and measurements.",
    "moduleCredit": "4",
    "department": "Mathematics",
    "faculty": "Science",
    "workload": [
      3,
      1,
      0,
      3,
      3
    ],
    "preclusion": "GEH1036.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1508",
    "title": "Einstein's Universe & Quantum Weirdness",
    "description": "Einstein's Ideas of our Universe and his Quantum contributions has greatly impacted the human societies.  Students will also be enthused with the historical and philosophical development of Relativity and Quantum Theories. Einstein's relativistic thinking eventually leads to the creation of navigational systems that are used in transportation and communication, both by the military as well as hand phone consumers. The construction of nuclear plants is made possible by the relativistic results of mass and energy conversion. Einstein's Photoelectric discoveries also pave the way for modern cameras in the ubiquitous mobile devices. The quest for new quantum particles at the colliders by huge collaborations among many countries gave birth to the World Wide Web and the internet Culture.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "preclusion": "PC1325, GEH1027",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1509",
    "title": "The Emerging Nanoworld",
    "description": "This module will acquaint students with the rapid development of the nanoworld with insights into the impact of this emerging technology on our society, environment and human life. The essence of nanoscience and technology lies in the understanding and manipulation of molecules.  The advances in these fields are expected to significantly influence our lives in the spheres of medical, engineering, ethical and environmental issues. This module will discuss the potential benefits and challenges of novel nanotechnologies. How does nanotechnology affect society and human interaction?  How will nanodevices and nanomaterials change our lives in the future?",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "preclusion": "GEH1028",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1520",
    "title": "Understanding the Universe",
    "description": "The first part of the module covers the observations of celestial objects and their influences on the ancient cultures. Students will learn how calendars and astrology were developed, and how the fundamental laws of nature were discovered. The second part covers the use of telescopes and space missions to explore the universe. Discoveries of stars and galaxies and their impact on mankind's perceptions of the Universe will be explored. Students will learn how Earth formed as a planet that develops and sustains life. There will be a discussion on the latest developments in searching for Earth-like extraterrestrial objects, and explore their impacts on the societies.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "preclusion": "GEH1031. Students majoring in Physics are not allowed to take this module.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1522",
    "title": "Global Environmental Issues",
    "description": "GEK1522 is an interdisciplinary module that brings together perspectives from different disciplines to provide deep insights into known and emerging global environmental issues and to develop polcies for achieving environmental, economic and social sustainability in a holistic manner. Given the scope of the module and its educational outcomes, the module draws students from diverse disciplines within NUS including \"Law\", \"Business\" and \"Computing\", etc. The key strength of the module is its diversity in terms of disciplinary composition. To take advantage of this diversity, the module promotes \"collaborative learning\" through peer teaching & learning by dividing the large class (120 to 130 students) into multi-disciplinary teams of 5 students.  The instructor assigns reading materials to individual teams on broad topics that cut across human society and culture.",
    "moduleCredit": "4",
    "department": "Civil and Environmental Engineering",
    "faculty": "Engineering",
    "workload": [
      2,
      1,
      0,
      1,
      2
    ],
    "preclusion": "GEH1025",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-28T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1522T",
    "title": "Global Environmental Issues",
    "description": "Environmental protection is now fundamental to the development of a sustainable global society. No longer is human\ninfluence on the planet confined to the local environment, but now extends across political boundaries - often resulting in regional or even global impacts. As a result, society, industry and agriculture are under increasing pressure to improve environmental performance and cut resource consumption and pollution. Around the world, governments are striving to minimise waste production, protect water resources, reduce energy consumption and improve the quality of the urban living environment. As the human global population grows exponentially and the life-support systems of the planet continue to deteriorate, there is a growing international recognition that environmental problems require truly global solutions. This course will focus on the issues and causes of global environmental issues including: population growth, resource exploitation and threats to the atmosphere, hydrosphere and biosphere. The aim of the course will be to provide students with a knowledge and appreciation of the inter-related problems and challenges of sustainable\ndevelopment.",
    "moduleCredit": "4",
    "department": "SCALE Dean's Office",
    "faculty": "Cont and Lifelong Education",
    "workload": [
      2,
      1,
      0,
      1,
      2
    ],
    "preclusion": "GEK1522, GEH1025, GEH1025T",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-11T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 3,
        "examDate": "2019-07-13T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1529",
    "title": "Food & Health",
    "description": "This module will examine the current thinking and information as regards the importance of diet and health. It will explore traditional and more modem views on what constitute an adequate and healthy diet. The composition of food along with potential contaminants of food will be examined and how an individual needs to consider their diet in relation to specific needs. The aim will be to educate the students on the need for and the composition of a healthy diet and how to obtain this and remain healthy during the important years of development in early adulthood. There is now much more emphasis on the role of food in preventative medicine and how a well balanced diet can keep one fit and healthy. It is necessary to be aware of the composition of various foods and how different methods of processing and cooking may affect the compositional quality of the product.",
    "moduleCredit": "4",
    "department": "Chemistry",
    "faculty": "Science",
    "workload": [
      2,
      0,
      0,
      5,
      3
    ],
    "preclusion": "GEH1019 and GEM1908",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-27T01:00:00.000Z",
        "examDuration": 90
      }
    ]
  },
  {
    "moduleCode": "GEK1531",
    "title": "Cyber Security",
    "description": "The Internet has become the most widely used medium for commerce and communication as its infrastructure can be quickly and easily set up to link to the worldwide network and access information globally. Its growth over the last few years has been phenomenal. With these activities, countries are beginning to recognize that this new technology can not only expand the reach and power of traditional crimes, but also breed new forms of criminal activity. \n\n\n\nOn the successful completion of this module, students should gain sufficient baseline knowledge to be able to identify, assess and respond to a variety of cybercrime scenarios, including industrial espionage, cyber-terrorism, communications eavesdropping, computer hacking, software viruses, denial-of-service, destruction and modification of data, distortion and fabrication of information, forgery, control and disruption of information. \n\n\n\nStudents will also learn about countermeasures, including authentication, encryption, auditing, monitoring, technology risk management, intrusion detection, and firewalls, and the limitations of these countermeasures.",
    "moduleCredit": "4",
    "department": "Mathematics",
    "faculty": "Science",
    "workload": [
      3,
      0,
      0,
      4,
      3
    ],
    "preclusion": "GET1004",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1534",
    "title": "Microbes which Changed Human History",
    "description": "The primary aim of the module is to introduce students to the nature of infectious diseases and their impact on human activities.  At the end of the module, students will be able to understand the interactions between microorganisms and human, and the position and role of human in the living world.",
    "moduleCredit": "4",
    "department": "Microbiology and Immunology",
    "faculty": "Yong Loo Lin School (Medicine)",
    "workload": [
      2,
      2,
      0,
      3,
      3
    ],
    "preclusion": "GEH1043",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1539",
    "title": "A Brief History of Science",
    "description": "Nowadays it is all too easy to take basic science laws and theories, such as Newtons law of gravitational attraction or evolution for granted. The impact of research breakthroughs on society at the time of their development is being forgotten, as they come to be taken for granted. Even Science students tend to be unaware of how modern concepts have arisen, what their impact was at the time and how they changed the world. This course is intended to explain the history and significance of scientific developments on societies and how perceptions of the world have changed as a result.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEH1018",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-08T09:00:00.000Z",
        "examDuration": 90
      }
    ]
  },
  {
    "moduleCode": "GEK1540",
    "title": "Modern Technology in Medicine and Health",
    "description": "The human race has entered an epoch where life span has increased significantly. During the twentieth century, life span has increased from around 50 to over 75 years mainly due to antibiotics, vaccinations, and improved nutrition. However this increase in lifespan has brought to the forefront a rise in many age-related diseases. These diseases, which include cancer, heart disease, Alzheimer’s disease, Parkinson’s disease, are now a focus of health care in the 21st century. This course describes many of these diseases, and their diagnosis and treatment using advanced technology found in modern hospitals. The course also provides an insight into the scientific principles underlying these new and powerful technologies.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEH1032",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1544",
    "title": "The Mathematics of Games",
    "description": "Games being a form of human activities since antiquity are often played with strategies that require critical thinking and decision making. Many of the number games like the game of nim have a rich mathematics favour. Real life social games contain combinatorial and probabilistic strategies. Simple economic activities can also be modelled in terms of games.  In this module, selected real-life social games are discussed and treated in ways that bring out their mathematical creativity. The objective is to let students gain an appreciation of mathematics, its beauty and applications through the discussion of some of these games. In particular, we give an introduction of elementary non-zero sum and non-cooperative game as developed by von Neumann and Nash.",
    "moduleCredit": "4",
    "department": "Mathematics",
    "faculty": "Science",
    "workload": [
      3,
      1,
      0,
      0,
      6
    ],
    "preclusion": "GET1018.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-08T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK1547",
    "title": "The Art of Science, the Science of Art",
    "description": "It often seems the worlds of science and art are unrelated: Logical truth versus emotional imagination. Still, science and art have much in common. Science has caused paradigm shifts in artistic expression while art is used for engineering design and communication of scientific knowledge. In this module, students will be introduced to the use of materials and technology related to architecture, sculpture, painting, photography and imaging. The use of technology for dating and attribution of objects of art  as well as the use of visual art for scientific illustration and design will be examined. Knowledge of the scientific principles of various forms of visual art will also be explored. The module aims at the development of some artistic skills for illustrations of scientific concepts and engineering designs. This module will help students to better express their thoughts through artistic expression and appreciate visual art.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      1,
      6
    ],
    "preclusion": "GET1014",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1548",
    "title": "How the Ocean Works",
    "description": "About three-quarters of the surface of our home, the Earth, is covered by an ocean of water! The ocean is inseparably intertwined with human settlements. Day in, day out, directly, indirectly - from the air that we breathe to climate change, trade, politics or social holidays - the presence and the influence of the ocean is undeniable on the human society. We will discuss how the ocean is connected to our lives, how the various ocean phenomena affect our lives and our attempts at controlling and exploiting the ocean. Students will gain an appreciation of the scientific principles involved. This course will also help us make educated decisions about our environment and our ocean, so that future generations may also enjoy the majesty of our blue planet, as we do now.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      3,
      1,
      0,
      0,
      6
    ],
    "preclusion": "GEH1033",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1549",
    "title": "Critical Thinking And Writing",
    "description": "The challenges of a global engineer increasingly call upon engineers to think critically and communicate effectively to undertake developmental\nleadership. This course aims to develop and practise students’ critical thinking and writing skills through analysing case studies in engineering leadership, constructing complex engineering-related problems and solutions, presenting arguments effectively and reflecting on personal leadership development. Relevance to engineering practice is emphasized with references to grounded theories of engineering leadership (Colcleugh, 2013; Rottman, Sacks & Reeve, 2015) and the seven missing basics of engineering education (Goldberg,\n2009).",
    "moduleCredit": "4",
    "department": "Center for Engl Lang Comms",
    "faculty": "NUS",
    "workload": [
      1.5,
      2,
      0,
      4,
      2.5
    ],
    "prerequisite": "1. Students who are required to read ES1000 and/or EAP modules ES1102/ES1103 must pass it/them before taking ES1531/GEK1549.\n2. Only students matriculated in AY2014/15 are allowed to take GEK1549.",
    "preclusion": "IEM1201%, UTW1001%, GEK1901, GET1021. U-town students cannot bid for ES1531/GEK1549.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK1900",
    "title": "Public Health in Action",
    "description": "From the global increase in obesity to SARS, a range of health issues and solutions will be explored in differing contexts throughout the world. Working in small groups, students debate and evaluate paths to addressing global health issues in a variety of cultural contexts. For example, lessons learned about tuberculosis in Russia may be applied to the Singaporean context, or students may examine efforts to prevent newborn deaths in developing nations. Students will develop an appreciation of how the health of an entire population impacts individuals and how complex problems can be prevented or addressed using culturally appropriate solutions.",
    "moduleCredit": "4",
    "department": "SSH School of Public Health Dean's Office",
    "faculty": "SSH School of Public Health",
    "workload": [
      0,
      3,
      0,
      3,
      4
    ],
    "preclusion": "GEH1049",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK2001",
    "title": "Changing Landscapes of Singapore",
    "description": "This module attempts to understand the rationale of changes in Singapore's urban landscape.  It places these changes within a framework that considers Singapore's efforts to globalise and examines how policies are formulated with the idea of sustaining an economy that has integral links sub-regionally with Southeast Asia while developing new spatial linkages that will strengthen its position in the global network.  Emphasis is also given to recent discussions about how diversity and difference in the perception and use of space pose a challenge to the utilitarian and functional definition adopted by the state.",
    "moduleCredit": "4",
    "department": "Geography",
    "faculty": "Arts and Social Science",
    "preclusion": "SSA2202, GES1003",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2
      },
      {
        "semester": 4
      }
    ]
  },
  {
    "moduleCode": "GEK2002",
    "title": "Philosophy of Art",
    "description": "Art and aesthetics raises deep philosophical puzzles. Sunsets are beautiful because they’re pleasing. But they seem pleasing because they’re beautiful. Galleries display some things because they’re art. But some things are art because galleries display them. Just as the Mona Lisa resembles Lisa, she resembles it. But she does not represent it as it represents her. When one watches a horror film one feels fear, but one does not run away. When one listens to instrumental music one feels sad, but there’s nothing one is sad about. This course addresses the central philosophical questions with which these puzzles are entangled.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK2003",
    "title": "Government and Politics of Singapore",
    "description": "This course examines a number of areas in Singapore's domestic politics with the following objectives: identify the key determinants of Singapore's politics; understand the key structural-functional aspects of Singapore's domestic politics; examine the extent to which nation building has taken place in Singapore; and analyse the key challenges facing Singapore and its future as far as domestic politics is concerned. The course examines both the structural-functional aspects of domestic politics as well as issues related to nation building, state-society relations and the likely nature of future developments and challenges.",
    "moduleCredit": "4",
    "department": "Political Science",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "PS1102, GEM2003K, SS2209PS, PS2101B, SSA2209, PS2101, PS2249. Not for students majoring in PS.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-04T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK2005",
    "title": "Urban Planning in Singapore",
    "description": "This module aims to give students an understanding of the nature of urban planning, basic planning models and theories. Urban planning will be discussed, in the context of urbanisation and globalisation, as an important force shaping the modern human settlements. A study of the institutional aspect of planning will relate to Singapore’s planning system in which issues of planning implementation will be elaborated. Learning objectives: Understanding nature of urban planning; understanding urban planning processes; understanding urban planning principles. Major topics to be covered: Urbanisation history and its impact; Urban forms: organic growth of urban settlements; Utopian city/the garden city movement; The city beautiful movement/ Neighbourhood; New town; Urban design and conservation; Institutional Structure for planning; Concept Plan and Master Plan; Development control/planning implementation; Planning analysis: population and transportation; Public participation in planning.",
    "moduleCredit": "4",
    "department": "Real Estate",
    "faculty": "Design and Environment",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "Not for Real Estate students and first year students and GES1026",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK2013",
    "title": "Real Estate Finance",
    "description": "The main aim of this module is to equip course participants with the basic principles for real estate financial analysis. A secondary objective is to provide course participants with an appreciation of the linkages between real estate, credit and capital markets. Students will specifically learn the financial tools necessary for evaluating lending and borrowing decisions and apply them to real estate investments. They will also be exposed to the institutional framework in Singapore such as the prevailing mortgage market conditions and CPF rules. In addition, students will study the more recent innovation in the field of real estate finance and investment.",
    "moduleCredit": "4",
    "department": "Real Estate",
    "faculty": "Design and Environment",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "Not for Real Estate students",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-29T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK2020",
    "title": "Film Art and Human Concerns",
    "description": "Can movies engage with serious concerns? Through the close study of films by great directors, this module explores how film as an artistic medium can be used to engage with significant socio-cultural and existential concerns. Students will be taught how to analyze film as an artistic medium and, further, how film directors use the aesthetic elements of film to engage with important subjects. Through films by directors like Stanley Kubrick, Orson Welles, Wong Kar-Wai and Zhang Yimou, students get a chance to reflect on issues like the human condition, the family, the urban condition, love and society, and the nation.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "preclusion": "GEH1053",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK2022",
    "title": "Samurai, Geisha, Yakuza as Self or Other",
    "description": "This module challenges the foundation of human knowledge. Examining cultural icons from Japan's past and present we will unpack the assumptions, stereotypes, narrative strategies, and visualizing techniques of representing Japan. Students will probe one or more of Japan's three famous cultural icons - the samurai, the geisha, and/or the yakuza - as they appear in literature, visual and performance arts, and academic writings. By the end of the module students will not only have a richer understanding of the 'realities' behind such icons, but more significantly, they will be equipped to challenge stereotypes of Japan presented by journalism, popular culture, and the humanistic and social sciences.  Ultimately such discovery will lead students to question their own knowledge of self and other. Students should refer to the module IVLE page for details of the selected icon(s) for the current semester.",
    "moduleCredit": "4",
    "department": "Japanese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEH1014",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEK2025",
    "title": "Politics of the Middle East",
    "description": "This module provides a comparative overview of politics in the Middle East, giving particular attention to the history, societies, and cultures of the region. It considers\nsome of the forces shaping its politics and discusses, selectively, major issues and challenges facing states in the Middle East today.",
    "moduleCredit": "4",
    "department": "Political Science",
    "faculty": "Arts and Social Science",
    "preclusion": "PS2255",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEK2028",
    "title": "Founders of Modern Philosophy",
    "description": "This module looks at the beginnings of modern Western philosophy in the seventeenth century, when philosophers conceived of themselves as breaking away from authority and tradition. It will deal with central themes from the thought of Descartes, Locke, Berkeley, Leibniz and Spinoza; in particular, the attempt to provide foundations for knowledge and science.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "preclusion": "PH2206",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEK2029",
    "title": "Applied Ethics",
    "description": "This module considers some of the significant normative ethical theories in the history of moral philosophy and examines how their principles may be applied to ethical issues of practical concern. There is a wide range of topics that are typically understood to come under the category of applied ethics. These include ethical issues pertaining to the family, food, race relations, poverty, punishment, conduct in war, professional conduct in general, and so on. The specific topics to be dealt with may vary from semester to semester, and the selection will be announced at the start of the semester in which the module is offered.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "preclusion": "PH2208",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-09T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK2036",
    "title": "Greek Philosophy (Socrates and Plato)",
    "description": "Socrates and Plato stand at the source of the Western Philosophical tradition. Alfred Whitehead said that “the safest general characterization of the European philosophical tradition is that it consists of a series of footnotes to Plato.” Through a close reading and analysis of several representative Platonic dialogues, this module introduces the student to the philosophy of Plato and Socrates (Plato’s teacher and main interlocutor in his dialogues), and prepares him/her for PH 3222 on Aristotle’s philosophy and the Honours seminar on Greek Thinkers. The module may include material on earlier Philosophy forming the background to Socrates and Plato.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "preclusion": "PH2222, PH3209",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEK2041",
    "title": "Science Fiction and Philosophy",
    "description": "This module considers science fiction as a mode of philosophical inquiry. Science fiction stories are used to examine fundamental questions of metaphysics,\nepistemology and ethics. Topics include the nature of time, space, religion, nature, mind, and the future. Specific topics may include such issues as genetic enhancement, environmental ethics, and implications of encounters with non‐human life forms.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "PH2225, GET1025",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEK2042",
    "title": "Cultural Borrowing: Japan and China",
    "description": "Humans have always actively borrowed from other cultures. Such borrowing is a creative process which influences aspects of life ranging from basic material\nneeds to aesthetic appreciation. Often, however, cultural borrowing is labelled as simple imitation. This results in cultural stereotypes that impede understanding of other cultures. Using Chinese and Japanese cultural borrowings as illustration, this module teaches second and third year students to analyze the creative process of cultural exchange. By developing theoretical perspectives from the study of China and Japan, students will learn about exchanges among culture in general.",
    "moduleCredit": "4",
    "department": "Japanese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEH1015",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEK2044",
    "title": "Reading Visual Images",
    "description": "The module introduces students to ways of looking at and discussing works of art. The focus is chiefly on painting and sculpture; the emphasis is on analyzing the composition or design of art works and in constructing meanings for them. The study of this module enables students to acquire critical skills for interpreting and connecting with works of art. The module encourages students to read art works in relation to a range of interests, intentions and issues; the aim here is to suggest or propose contexts or environments in which art works are made and received. \nThere are three sections. In the first, three (3) topics from Asian art traditions are discussed. The are :\n1. Indian sculpture\n2. Chinese landscape painting \n3. Islamic calligraphy\nIn the second section, ideas and movements from the Renaissance in Italy to the end of the 20th century in Europe, are surveyed.",
    "moduleCredit": "4",
    "department": "Architecture",
    "faculty": "Design and Environment",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "preclusion": "AR2225",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK2048",
    "title": "Effective Reasoning",
    "description": "What is good reasoning? We will try to answer this question by studying the mechanics of reasoning. Students will learn what an argument is, what the difference between validity and soundness is, and what it means to say that an argument is valid in virtue of its form. They will also be introduced to various strategies and pitfalls in reasoning. In addition, to hone their analytical skills, students will be given arguments—drawn from philosophy and other areas—to unpack and evaluate. It is hoped that in the process of learning what counts as good reasoning, one will become a better reasoner.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "PH2111, GET1026",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEK2050",
    "title": "Digital Humanities in Arts Research",
    "description": "Digital technologies let us do humanities differently, using interactive publishing, machine-driven analysis, media-rich platforms, online archives and crowd-sourced databases. How are these technologies changing the humanities? This module invites students from across the university to consider this question through a problem-based approach. In each session, the students will learn to use and critically evaluate digital tools and platforms. Reflecting the multiple approaches within the digital humanities, teaching combines seminar discussions of topics with hands-on training in web programming, text encoding and video processing techniques.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      0.5,
      0.5,
      0,
      7
    ],
    "preclusion": "GET1030",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEK3005",
    "title": "Politics and the Visual",
    "description": "This module explores the many forms of relationship between politics and visual culture. From the ancient world to the present, politics, whether formal or popular, has had a visual dimension. Politicians have been concerned to control their appearance; various media (from painting to theatre to television to the internet) have been used to both serve and defeat this goal. The module surveys the relationship between politics and visual culture and allows students to engage with contemporary issues surrounding politics, film, and digital culture.",
    "moduleCredit": "4",
    "department": "Political Science",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "PS3260",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEM1003",
    "title": "Introduction to Theatre and Performance",
    "description": "This module will provide students with foundational knowledge of the\ndifferent aspects of, approaches and discursive contexts relating to the study and praxis of theatre and performance. The module will also introduce students to the various forms of classical and contemporary performance practices and their attendant modes of analyses: combining play analysis, theatre history & theory. Using complementary content‐centred lectures and practice laboratory, the module creates an environment where students simultaneously engage with module content while investigating its relations to the creation of theatre and performance.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      1,
      1,
      2,
      4,
      2
    ],
    "prerequisite": "Exempted from NUS Qualifying English Test, or passed NUS\nQualifying English Test, or exempted from further CELC Remedial English modules.",
    "preclusion": "TS1101E",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2,
        "examDate": "2019-04-27T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEM1004",
    "title": "Reason and Persuasion",
    "description": "The first six weeks  we read Plato (a 5th Century BC Greek, of whom it has been said, 'All of Western thought is just footnotes to Plato') and Descartes (a 17th Century Frenchman, of 'I think therefore I am' fame.) The second six weeks concern questions and problems raised by Plato and Descartes. We will mull the metaphysics of mind and consciousness; ponder the politics of freedom. The module title hints at a basic question: what sorts of ways of convincing people, and being convinced by people - about life, about anything - are good ways?",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "preclusion": "GET1027",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEM1029",
    "title": "Patrons of the Arts",
    "description": "This course is a conceptual and practical introduction to the complex networks that drive \"patronage,\" including multifarious kinds of patronage. Issues raised and debated include exploring money, religion, politics, social classes, and many other social constructs that influence what art people support, and why they, especially you, support different kinds of art. Students will need to grasp and evaluate critically each set of issues that drive and affect patronage of the arts, and demonstrate their critical understanding of the interplay of these factors through written assessments, classroom discussions, and contributions to blog postings related to the module materials.",
    "moduleCredit": "4",
    "department": "YSTCM Dean's Office",
    "faculty": "YST Conservatory of Music",
    "workload": [
      0,
      2,
      0,
      4,
      4
    ],
    "preclusion": "MUL2102, GET1019",
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEM1031",
    "title": "Names as Markers of Socio-cultural Identity",
    "description": "This module focuses on names as a means of marking out the socio-cultural identity of the named and of the namer. Attention will be paid to anthroponyms (personal names), toponyms (place names) and commercial names. This module will be interdisciplinary in nature and will combine a range of approaches to names. Linguistic and philosophical approaches will provide the theoretical anchor to the topic of names. Subsequent seminars will contextualise names in their historical, geographical, political and literary contexts. There will be scope for students to develop the module in the direction of their interests in the mini project.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      0,
      3,
      0,
      2,
      5
    ],
    "preclusion": "GEH1054",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-04T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEM1033",
    "title": "Religion and Film",
    "description": "Cinematic and literary expression centred on religious topics can be studied to see how the vitality of cultural expression and power of the religious imagination interrelate. No prior training in artistic interpretation or religious history is required, though the module presumes a curiosity about religion and culture. It trains students to think about why people sometimes enjoy seeing films about painful topics. It clarifies the difference between “studying” and “practising” religion, and it teaches students to discuss controversial topics with tact.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEH1055",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEM1036",
    "title": "Globalisation and New Media",
    "description": "This module offers students an introduction into the role of new communication technologies in the context of globalization. We will explore various aspects of global communication flows including the global reach of new media and its consequences, global and transnational timesharing and workflows, the role of new media in global and local politics, and the potential of new and traditional communication channels in the context of various forms of activism and communication for social change. The role of culture in global communication and ways in which cultural processesshape and are shaped by the landscape of globalization will be emphasized.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEH1001",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-05T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEM1050",
    "title": "Framing Bollywood: Unpacking The Magic",
    "description": "Bollywood Cinema is recognised as the most vibrant form of cultural media in India, one whose influence now extends to many parts of the world. By studying the content and meaning of selected Bollywood films, this module will introduce students to key social, economic, political and cultural issues in India, and\nexplore important concepts in the humanities and social sciences such as nationalism, gender and sexuality, diaspora and globalisation.",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEH1009",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-01T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2
      },
      {
        "semester": 4
      }
    ]
  },
  {
    "moduleCode": "GEM1051",
    "title": "Ethnicity and Nation-Building: Singapore and Malaysia",
    "description": "This module examines policies and programmes dealing with ethnic relations based on the experiences of Singapore and Malaysia. It focuses on how these much talked about and debated policies, impact or affect the Malays in particular, who constitute a numerical minority in Singapore, but form the majority in Malaysia. The module examines major socio‐historical factors\nconditioning these policies and programmes and the processes by which they are materialised from the period of British colonialism to the present. How these efforts bear upon nation building and national integration will be explored.",
    "moduleCredit": "4",
    "department": "Malay Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "GES1008",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-03T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEM1052",
    "title": "Understanding the Changing Global Economic Landscape",
    "description": "Why and how have things changed and moved so fast? Why and how has the global economy become more open and integrated? This module discusses the increasing connections and mobilities of goods (like grains, oil, cars, appliances, parts & components), services (like banking, education, tourism), money and finance, labour, technology, ideas and information. It discusses their trends and patterns and critically examines the role of various factors such as international and regional institutions, media and ICT, infrastructure and distribution networks, state intervention, and private sector involvement. It also assesses the social, economic, political and environmental impacts of increasing interconnectedness and mobilities.",
    "moduleCredit": "4",
    "department": "Southeast Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GET1016",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-01T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEM1052T",
    "title": "Understanding The Changing Global Economic Landscape",
    "description": "Why and how have things changed and moved so fast? Why and how has the global economy become more open and integrated? This module discusses the increasing connections and mobilities of goods (like grains, oil, cars, appliances, parts & components), services (like banking, education, tourism), money and finance, labour, technology, ideas and information. It discusses their trends and patterns and critically examines the role of various factors such as international and regional institutions, media and ICT, infrastructure and distribution networks, state intervention, and private sector involvement. It also assesses the social, economic, political and environmental impacts of increasing interconnectedness and mobilities.",
    "moduleCredit": "4",
    "department": "SCALE Dean's Office",
    "faculty": "Cont and Lifelong Education",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEM1052, GET1016, GET1016T",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 3,
        "examDate": "2019-07-13T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEM1535",
    "title": "Clean Energy and Storage",
    "description": "Modern civilization, which on the one hand boasts of having discovered the behaviour of subatomic particles, has also to its credit the impending intensified energy crisis and global warming. The urgent need to address these challenges has now become obvious. The course will acquaint students with the role of scientific development towards understanding the current global energy crisis and global warming. Emphasis will be given on how scientific progress has helped us in understanding the principle and development of various clean energy and storage technologies, their potential and applicability in present day scenarios and in shaping future energy systems.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "preclusion": "GEH1034",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GEM1536",
    "title": "Darwin and Evolution",
    "description": "Charles Darwin is remembered like no other figure in the history of science. However, public understanding of Darwin and evolution remains a serious problem. What most people think they know about Darwin, his life and his famous book ‘On the origin of species’ is wrong. This module provides a solid background for understanding how the theory of evolution actually unfolded. It covers the history of geology, palaeontology and biology from the 1700s to the 20th century. The central focus is on the life and work of Charles Darwin and how biological evolution was uncovered, debated and accepted by the international scientific community in the 19th century, and beyond. There will be a lot of myth busting and this provides case studies on how to assess historical claims and evidence, and discussions on recent developments in evolutionary biology, human evolution and anthropology are included.",
    "moduleCredit": "4",
    "department": "Biological Sciences",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEM1902B Junior Seminar: The Darwinian Revolution\nGET1020",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-04T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GEM1913",
    "title": "Beasts, People and Wild Environments in South Asia",
    "description": "How do ideas about big beasts and the wild inform our socio‐cultural worldview? In other words, what is a “tiger” when it is not just a zoo animal but one that lives in a forest next to your home? In this introductory and interdisciplinary course to conservation and the environment, we will watch films and discuss novels and ethnographies focusing on human/animal relations in six different spheres: Mountains, Deserts, Rivers, Plains, Forests, and Sea. The course aims to be an informative, provocative and fun introduction to an exciting and relatively new field of scholarship.",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      0,
      3,
      0,
      3,
      4
    ],
    "preclusion": "GEH1010",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEM2001",
    "title": "Introduction to Asian Theatre",
    "description": "This module focuses on the classical theatre forms of India, China, and Japan. Each tradition is examined within its socio-cultural context. Textual analysis of classical scripts from Sanskrit drama, Chinese opera, and Japanese theatre will also be conducted. Students' learning experience is often constructed in stimulated theatre settings to promote their creativity and to provide them with a working knowledge of performing arts. Students interested in theatre studies, South Asian studies, Chinese studies, and Japanese studies may particularly benefit from this module.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "TS2232",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEM2006",
    "title": "Logic",
    "description": "An introduction to classical logic. The first half of the course introduces propositional logic, using the techniques of truth-tables and linear proof by contradiction. The second half of the course extends the use of linear proof by contradiction to predicate logic. Emphasis is placed on applying the techniques to philosophical arguments.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "PH2110, CS3234, MA4207, GET1028",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEM2025",
    "title": "Introduction to Philosophy Of Science",
    "description": "An introduction to a spectrum of philosophical issues concerning modern science. These range from explaining the development of science, including a comparison with traditional approaches, to understanding nature in both the West and the East, to problems of the rationality of science. This will also involve a historical study of the development of philosophy of science in the Western tradition, from Bacon and Hume, through Mill, to Popper, Kuhn and Feyerabend.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "preclusion": "PH2201",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEM2027",
    "title": "Public Speaking and Critical Reasoning",
    "description": "This module prepares students to be effective and efficient public speakers. It offers an overview of the theories of oral communication and public speaking, with particular emphasis on effective speaking, listening and critique skills. It looks into adapting evidence, language, visual aids and other message characteristics through selected forms of public speaking for various purposes, audiences and contexts and includes practice in the critical analysis of speeches. It emphasizes strategic communication to enhance critical thinking skills, rhetorical fluency through reasoned thinking and expression of logical argument positions on local and global issues that impact our everyday lives.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      1,
      2,
      0,
      2,
      5
    ],
    "preclusion": "GET1008",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1000",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "preclusion": "GEQ1000H, GEQ1000E, GEQ1000K, GEQ1000W, GEQ1000R, GEQ1000S, GEQ1000T, GEQ1000P",
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      },
      {
        "semester": 3
      }
    ]
  },
  {
    "moduleCode": "GEQ1000E",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "prerequisite": "To be read by students from Eusoff Hall in Semester 2.",
    "preclusion": "GEQ1000, GEQ1000K, GEQ1000W, GEQ1000R, GEQ1000S, GEQ1000T, GEQ1000P",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1000H",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "prerequisite": "To be read by students from halls – Eusoff, Kent Ridge, King Edward, Raffles, Sheares, Temasek, PGPH",
    "preclusion": "GEQ1000, GEQ1000E, GEQ1000K, GEQ1000W, GEQ1000R, GEQ1000S, GEQ1000T, GEQ1000P",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1000K",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "prerequisite": "To be read by students from Kent Ridge Hall in Semester 2.",
    "preclusion": "GEQ1000, GEQ1000E, GEQ1000W, GEQ1000R, GEQ1000S, GEQ1000T, GEQ1000P",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1000P",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "prerequisite": "To be read by students from Prince George Park House in Semester 2.",
    "preclusion": "GEQ1000, GEQ1000E, GEQ1000K, GEQ1000W, GEQ1000R, GEQ1000S, GEQ1000T",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1000R",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "prerequisite": "To be read by students from Raffles Hall in Semester 2.",
    "preclusion": "GEQ1000, GEQ1000E, GEQ1000K, GEQ1000W, GEQ1000S, GEQ1000T, GEQ1000P",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1000S",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "prerequisite": "To be read by students from Sheares Hall in Semester 2.",
    "preclusion": "GEQ1000, GEQ1000E, GEQ1000K, GEQ1000W, GEQ1000R, GEQ1000T, GEQ1000P",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1000T",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "prerequisite": "To be read by students from Temasek Hall in Semester 2.",
    "preclusion": "GEQ1000, GEQ1000E, GEQ1000K, GEQ1000W, GEQ1000R, GEQ1000S, GEQ1000P",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1000W",
    "title": "Asking Questions",
    "description": "There are many ways to ask questions, and many kinds of questions that different disciplines investigate. For a start, this module introduces six dominant modes of questioning from the perspective of computational thinking, design thinking, engineering, philosophy, science, and social sciences. These six perspectives serve as a starting point to introduce all undergraduate students to different modes of questioning across these disciplines, and provide an initial exposure to how scholars from these disciplines pursue specific lines of questioning of everyday issues. We emphasize that while there is only limited time and space within one module to devote to specific disciplinary lines of investigations, we encourage all students to actively think about other lines of questioning, other questions that need to be asked, particularly in disciplines not represented in this introductory platform as we move through this journey together. We expect that in future subsequent offerings, other disciplinary modes of investigations may also be introduced.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "prerequisite": "To be read by students from King Edward VII Hall in Semester 2.",
    "preclusion": "GEQ1000, GEQ1000E, GEQ1000K, GEQ1000R, GEQ1000S, GEQ1000T, GEQ1000P",
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GEQ1917",
    "title": "Understanding and Critiquing Sustainability",
    "description": "This inter-disciplinary module will provide foundational knowledge and skills relating to the emerging problem of sustainability. Probing questions about how humans impact and react to environmental change will be asked. Students will explore current and future global environmental change issues from the standpoints of science, technology, and policy. The science behind global change (climate variability and change, natural weather disasters such as floods and droughts, environmental degradation); human aspects of change (water crises and conflict, agriculture and food security, energy sustainability, climate, health); and technology and policy issues relating to mitigation and adaptation (renewable energy, carbon trading, water resource engineering, agricultural development) will be covered.",
    "moduleCredit": "4",
    "department": "Ridge View Residential College",
    "faculty": "Residential College",
    "workload": [
      2,
      1,
      0,
      1,
      1
    ],
    "preclusion": "GEM1917 (twin-code)",
    "attributes": {
      "su": true,
      "year": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GER1000",
    "title": "Quantitative Reasoning",
    "description": "This module aims to equip undergraduates with basic reasoning skills on using data to address real world issues. What are some potential complications to keep in mind as we plan what data to collect and how to use them to address our particular issue? When two things are related (e.g. smoking and cancer), how can we tell whether the relationship is causal (e.g. smoking causes cancer)? How can quantitative reasoning help us deal with uncertainty or elucidate complex relationships? These and other questions will be discussed using real world examples.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GER1000E, GER1000K, GER1000W, GER1000R, GER1000S, GER1000T, GER1000P, GER1000B",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-29T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 3
      }
    ]
  },
  {
    "moduleCode": "GER1000E",
    "title": "Quantitative Reasoning",
    "description": "This module aims to equip undergraduates with basic reasoning skills on using data to address real world issues. What are some potential complications to keep in mind as we plan what data to collect and how to use them to address our particular issue? When two things are related (e.g. smoking and cancer), how can we tell whether the relationship is causal (e.g. smoking causes cancer)? How can quantitative reasoning help us deal with uncertainty or elucidate complex relationships? These and other questions will be discussed using real world examples.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "prerequisite": "To be read by students from Eusoff Hall in Semester 1.",
    "preclusion": "GER1000, GER1000K, GER1000W, GER1000R, GER1000S, GER1000T, GER1000P, GER1000B",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GER1000K",
    "title": "Quantitative Reasoning",
    "description": "This module aims to equip undergraduates with basic reasoning skills on using data to address real world issues. What are some potential complications to keep in mind as we plan what data to collect and how to use them to address our particular issue? When two things are related (e.g. smoking and cancer), how can we tell whether the relationship is causal (e.g. smoking causes cancer)? How can quantitative reasoning help us deal with uncertainty or elucidate complex relationships? These and other questions will be discussed using real world examples.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "prerequisite": "To be read by students from Kent Ridge Hall in Semester 1.",
    "preclusion": "GER1000, GER1000E, GER1000W, GER1000R, GER1000S, GER1000T, GER1000P, GER1000B",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GER1000P",
    "title": "Quantitative Reasoning",
    "description": "This module aims to equip undergraduates with basic reasoning skills on using data to address real world issues. What are some potential complications to keep in mind as we plan what data to collect and how to use them to address our particular issue? When two things are related (e.g. smoking and cancer), how can we tell whether the relationship is causal (e.g. smoking causes cancer)? How can quantitative reasoning help us deal with uncertainty or elucidate complex relationships? These and other questions will be discussed using real world examples.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "prerequisite": "To be read by students from Prince George Park House in Semester 1.",
    "preclusion": "GER1000, GER1000E, GER1000K, GER1000W, GER1000R, GER1000S, GER1000T, GER1000B",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GER1000R",
    "title": "Quantitative Reasoning",
    "description": "This module aims to equip undergraduates with basic reasoning skills on using data to address real world issues. What are some potential complications to keep in mind as we plan what data to collect and how to use them to address our particular issue? When two things are related (e.g. smoking and cancer), how can we tell whether the relationship is causal (e.g. smoking causes cancer)? How can quantitative reasoning help us deal with uncertainty or elucidate complex relationships? These and other questions will be discussed using real world examples.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "prerequisite": "To be read by students from Raffles Hall in Semester 1.",
    "preclusion": "GER1000, GER1000E, GER1000K, GER1000W, GER1000S, GER1000T, GER1000P, GER1000B",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GER1000S",
    "title": "Quantitative Reasoning",
    "description": "This module aims to equip undergraduates with basic reasoning skills on using data to address real world issues. What are some potential complications to keep in mind as we plan what data to collect and how to use them to address our particular issue? When two things are related (e.g. smoking and cancer), how can we tell whether the relationship is causal (e.g. smoking causes cancer)? How can quantitative reasoning help us deal with uncertainty or elucidate complex relationships? These and other questions will be discussed using real world examples.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "prerequisite": "To be read by students from Sheares Hall in Semester 1.",
    "preclusion": "GER1000, GER1000E, GER1000K, GER1000W, GER1000R, GER1000T, GER1000P, GER1000B",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GER1000T",
    "title": "Quantitative Reasoning",
    "description": "This module aims to equip undergraduates with basic reasoning skills on using data to address real world issues. What are some potential complications to keep in mind as we plan what data to collect and how to use them to address our particular issue? When two things are related (e.g. smoking and cancer), how can we tell whether the relationship is causal (e.g. smoking causes cancer)? How can quantitative reasoning help us deal with uncertainty or elucidate complex relationships? These and other questions will be discussed using real world examples.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "prerequisite": "To be read by students from Temasek Hall in Semester 1.",
    "preclusion": "GER1000, GER1000E, GER1000K, GER1000W, GER1000R, GER1000S, GER1000P, GER1000B",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GER1000W",
    "title": "Quantitative Reasoning",
    "description": "This module aims to equip undergraduates with basic reasoning skills on using data to address real world issues. What are some potential complications to keep in mind as we plan what data to collect and how to use them to address our particular issue? When two things are related (e.g. smoking and cancer), how can we tell whether the relationship is causal (e.g. smoking causes cancer)? How can quantitative reasoning help us deal with uncertainty or elucidate complex relationships? These and other questions will be discussed using real world examples.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "prerequisite": "To be read by students from King Edward VII Hall in Semester 1.",
    "preclusion": "GER1000, GER1000E, GER1000K, GER1000R, GER1000S, GER1000T, GER1000P, GER1000B",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1000T",
    "title": "Labour Law In Singapore",
    "description": "The course introduces students to the development of industrial relations and labour laws in Singapore. Students can thus understand why labour relations are the way they are in Singapore. In addition, the course is not purely historical. A substantial part of the course is also aimed at looking at the current legal problems faced by the employees end employers in Singapore. This course will be of general relevance to all as students in all likelihood going to be employees or employers some day. This course is offered to BTech students only.",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "SSB1204, SSB1204T, GES1000",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GES1002",
    "title": "Global EC Dimensions of S'pore",
    "description": "This course will introduce students to the dynamics of the world economy and the impact on Singapore in the last two centuries. It will demonstrate how Singapore grew through continual dependence on the rest of the world in different ways by focusing on major labour, capital and technological factors, in which threats are also seen as opportunities.",
    "moduleCredit": "4",
    "department": "Economics",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": true,
    "preclusion": "SSA2220, SSA2220T, GES1002T",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-01T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-29T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1002T",
    "title": "Global Economic Dimensions Of Singapore",
    "description": "This course will introduce students to the dynamics of the world economy and the impact on Singapore in the last two centuries. It will demonstrate how Singapore grew through continual dependence on the rest of the world in different ways by focusing on major labour, capital and technological factors, in which threats are also seen as opportunities. This course is offered to BTech students only.",
    "moduleCredit": "4",
    "department": "Economics",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "EC2202, EC2373, GES1002, SSA2220, SSA2220T",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-04T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 3,
        "examDate": "2019-07-15T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1003",
    "title": "Changing Landscapes of Singapore",
    "description": "This module attempts to understand the rationale of changes in Singapore's urban landscape.  It places these changes within a framework that considers Singapore's efforts to globalise and examines how policies are formulated with the idea of sustaining an economy that has integral links sub-regionally with Southeast Asia while developing new spatial linkages that will strengthen its position in the global network.  Emphasis is also given to recent discussions about how diversity and difference in the perception and use of space pose a challenge to the utilitarian and functional definition adopted by the state.",
    "moduleCredit": "4",
    "department": "Geography",
    "faculty": "Arts and Social Science",
    "projects": true,
    "webcasts": false,
    "preclusion": "GEK2001, SSA2202",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-27T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 4
      }
    ]
  },
  {
    "moduleCode": "GES1004",
    "title": "The Biophysical Env of S'pore",
    "description": "The module will focus on the functions of the biophysical environment of the city state of Singapore. The topics include geology, soils, river systems, water supply, natural reserves, green areas, land reclamation and coastal environments. The environmental problems that arise from the development of a large tropical city within a limited area, and the possible solutions for such problems will be examined. The module does not require an extensive science or mathematics background.",
    "moduleCredit": "4",
    "department": "Geography",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": false,
    "webcasts": false,
    "preclusion": "SSA2215",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-30T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1005",
    "title": "Everyday Life of Chinese Singaporeans: Past & Present (taught in English)",
    "description": "Studies on the everyday life of ordinary people offer an important perspective for understanding human history. This module examines the daily life of Chinese\nSingaporeans during the late 19th to 20th centuries, focusing on their cultural expressions and social actions, revolving around eight geo‐cultural sites, namely, Singapore River, Chinatown, Chinese temples, clan associations, opera stages, amusement parks, hawker centres, and streets/roads. Students are asked to compare the past and present of these sites through oral history and fieldwork observation.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "SSA1208",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GES1006",
    "title": "Singapore and India: Emerging Relations",
    "description": "The module aims to examine the evolving economic linkages between Singapore and India in a post Cold War setting and attempts to explain the factors that have led to their enhanced economic collaboration based on areas of complementarity.  The module will use concepts like economic regionalism, Singapore's regionalization policy and India's \"Look East\" policies to explain the confluence of national interests that has enhanced bilateral economic ties between both countries. In particular it will examine bilateral collaboration in infrastructure development (ports and telecommunications) and services (airline and tourism) industries to explain the success and problems of bilateral economic collaboration. The target audiences are students from various Faculties who would like to have a better understanding of Singapore's evolving foreign economic policy in South Asia in an increasingly globalised economy.",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": false,
    "webcasts": false,
    "preclusion": "SSA2214",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-06T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1007",
    "title": "South Asia in Singapore",
    "description": "The South Asian presence in Singapore is an important part of Singapore's multicultural society: in terms of the 'Indian' community and its economic and commercial influence; its religious and artistic impact; and its role in the everyday life of the nation (eg. cuisine, sport and entertainment). Students will be provided the opportunity to understand the nature of South Asian migration to Singapore, the significance of the South Asian community and its contributions to Singapore's development.  Students will be provided with the necessary framework to study and analyse the historical and socio-economic development of the community and South Asian identity and concerns.  The module will develop critical and analytical skills guiding students in the process of social scientific enquiry. The target students are undergraduates from all Faculties.",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "SSA2219",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-30T06:30:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-07T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1008",
    "title": "Ethnicity and Nation-Building: Singapore and Malaysia",
    "description": "This module examines policies and programmes dealing with ethnic relations based on the experiences of Singapore and Malaysia. It focuses on how these much talked about and debated policies, impact or affect the Malays in particular, who constitute a numerical minority in Singapore, but form the majority in Malaysia. The module examines major socio‐historical factors conditioning these policies and programmes and the processes by which they are materialised from the period of British colonialism to the present. How these efforts bear upon nation building and national integration will be explored.",
    "moduleCredit": "4",
    "department": "Malay Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "projects": true,
    "webcasts": false,
    "preclusion": "GEM1051",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-03T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-06T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1009",
    "title": "Singapore’s Business History",
    "description": "This module traces the business history of Singapore from its origins as an East India Company outpost, as an entrepot for regional and international trade routes to its current status as a global city and center for international finance and business.  This module offers an introduction to business history and explores different case studies in the local context.  These care studies range from 'rags to riches' stories of early migrant communities, popular local brands, and present day entrepreneurs.  Major topics include: trading communities, commodities, networks and migration, entrepreneurship, business culture, heritage, globalization, state, politics and business.",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "HY2239 and SSA2203",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-27T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1010",
    "title": "Nation-Building in Singapore",
    "description": "This module is about Singapore's emergence from British colonial rule and merger with Malaysia to independence and nation-building.  It covers political events, the economy, education, national service, ethnic relations, and culture and national identity.  Students are encouraged to think through issues central to these topics.  The module is tailored for students in all Faculties at all levels.",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "HY2229, USE2304 and SSA2204",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2,
        "examDate": "2019-05-07T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1010T",
    "title": "Nation-Building in Singapore",
    "description": "This module is about Singapore's emergence from British colonial rule and merger with Malaysia to independence and nation-building.  It covers political events, the economy, education, national service, ethnic relations, and culture and national identity.  Students are encouraged to think through issues central to these topics.  The module is tailored for students in all Faculties at all levels.",
    "moduleCredit": "4",
    "department": "SCALE Dean's Office",
    "faculty": "Cont and Lifelong Education",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "HY2229, USE2304, SSA2204, GES1010",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-07T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1011",
    "title": "The Evolution of a Global City-State",
    "description": "The history of Singapore has traditionally been conceived along internal lines, based mainly, if not solely, on the traditional trajectories of administrative, political and national historical narratives.  Yet, as we all know, the evolution of Singapore, from classical regional emporium to international port city and strategic naval base, has all along been defined by much larger regional and international forces.  After its emergence as a sovereign state in 1965, Singapore continues to project itself as a 'global city-state'.  Our local society has an 'international' make-up, being the product as it were of historical and current diasporic trends.  This module provides an international framework for a study of the history of Singapore, and seeks to examine the historical evolution of Singapore against the contexts of regional and international changes and developments from the 14th to the 20th century.  This module is open to all students throughout NUS interested in Singapore history/studies.",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "SSA2211",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-24T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-06T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1012",
    "title": "Popular Culture in Singapore",
    "description": "Popular Culture in Singapore is designed for both History and non-History students to look at the development of popular culture in Singapore from the colonial period to the present day. By learning about street theatre, local films, and theme parks among others, students will explore thematic issues like diasporic, immigrant and cosmopolitan communities; colonial impact; stratification of society by class, race and religion; surveillance; gender and the body; family and social spaces (theme parks, social clubs, sports fields). Students are expected to gain a sensitivity to historical contexts, and to better understand Singapores rich cultural heritage what has been lost, what has been recovered, the politics of heritage as well as the political, social and economic realities in Singapores historical trajectory.",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "HY2254 and SSA2221",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GES1013",
    "title": "Singapore Urban History & Architecture",
    "description": "This module introduces the urban history and architecture of Singapore from an inter-disciplinary perspective. It will cover the period from the ancient market and settlement of Tanma-hsi or Singapura, to the formation and development of a colonial town, and to the recent post-independence period, until the contemporary debates in Architecture and Urbanism in Singapore. The module, which is targeted at general audiences of undergraduate students, aims to stimulate intellectual discourse and critical thinking by using inter-disciplinary approaches to understanding the city and architecture.",
    "moduleCredit": "4",
    "department": "Architecture",
    "faculty": "Design and Environment",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "SSD2213",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-03T01:00:00.000Z",
        "examDuration": 90
      }
    ]
  },
  {
    "moduleCode": "GES1014",
    "title": "Islam and Contemporary Malay Society",
    "description": "This module examines the kinds of religious orientations that had evolved among the Malays of Singapore and analyzes major socio-historical factors that had shaped such orientations. The ways in which these religious orientations condition the responses of Singaporean Malays and their unique institutions to the challenges and demands of the modern world are then discussed. The module will explore the thought of Muslims thinkers on issues of reform relevant to the Malays of Singapore. A critical analysis and evaluation of the phenomenon of Islamic resurgence and revivalism in Singapore and the extent of its contribution to the progress of the community will also be explored. A theme underlying the topics of the module is the relevance of Islamic values and philosophy in facilitating Singaporean Malays adapt to the demands of social change and the plural society in which they live.",
    "moduleCredit": "4",
    "department": "Malay Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "SSA2206, MS2205.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-07T06:30:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-30T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1015",
    "title": "Singapore and Japan: Historical and Contemporary Relationships",
    "description": "This module aims to promote a better understanding of Singapore-Japan relations, combining historical, political, economic, social and cultural perspectives. Besides an examination of the history of interactions between people in Singapore and Japan from the late 19th century to the present, the module also helps students grasp issues affecting Singapore‘s position and perception in a wider geographical and cultural context by considering its relations with Japan. Students are actively encouraged to use oral history, fieldwork and internet for their projects.",
    "moduleCredit": "4",
    "department": "Japanese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "SSA2205, JS2224",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GES1017",
    "title": "Building a Dynamic Singapore - Role of Engineers",
    "description": "The focus of the module is to highlight how engineering and technology have contributed to the development of Singapore. The module is structured around case studies such as the creation of Jurong island, one-north, the water story etc. In these case studies, the constraints faced by Singapore (e.g. scarcity of land, lack of water) are overcome through technological, organizational and other forms of innovation. Simple diagrams that can be understood by layman are used to explain some of the innovations (e.g. the water loop).",
    "moduleCredit": "4",
    "department": "Industrial Systems Engineering and Management",
    "faculty": "Engineering",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "preclusion": "SSE1201",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-30T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1019",
    "title": "Managing Singapore's Built Environment",
    "description": "This module introduces students to the rationale for, and process of, the emergence and growth of Singapore?s built environment from a third world country to a world class city.  It enables students to have an understanding and appreciation of the economic and social aspects and implications of how properties and infrastructure are developed and managed, given the constraints that Singapore faces.  It also encourages them to develop alternative views on how the built environment can help Singapore continue to prosper and remain relevant in the region.  This module is open to all undergraduates who are interested in Singapore?s physical development.",
    "moduleCredit": "4",
    "department": "Building",
    "faculty": "Design and Environment",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "preclusion": "SSD2210",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1020",
    "title": "Western Music within a Singaporean Context",
    "description": "This module will look at the place of the Western Classical music tradition within the cultural life of Singapore. It will assess the impact of majority cultures (particularly from the Chinese, Malay and Indian communities) on the general reception of Western music, as well as on music written by Singapore-based composers. Students will be introduced to the principal figures in Singapore’s musical development. The module will also chart the growth of music education in Singapore, both in the national schooling system as well as in private institutions and tertiary academies. A prior knowledge of music is helpful but not required.",
    "moduleCredit": "4",
    "department": "YSTCM Dean's Office",
    "faculty": "YST Conservatory of Music",
    "workload": [
      2,
      2,
      0,
      2,
      4
    ],
    "preclusion": "SSY2223",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GES1021",
    "title": "Natural Heritage of Singapore",
    "description": "Located within one of the global centres of biodiversity, Singapore is endowed with a  rich natural heritage that is impacted by expanding urbanisation. Development poses a great challenge to  nature conservation and Singapore is an excellent model to study how a balance can be achieved. Students will be introduced to the country?s natural heritage, its historical, scientific and potential economic value.    You will have the opportunity to explore important habitats, and to think critically about the issues of sustainable development and the nation?s responsibility to posterity and to regional and international conventions related to biodiversity conservation. Students are expected to undertake the field trips on their own and at their own time within the semester; and will be encouraged to ?self-learn?. A special website with information on the places to visit  and their significance serves as a semi-interactive IT-resource. Suggested trails and what can be observed appear on the website. The students? independence and experiential learning aspects are strongly encouraged.",
    "moduleCredit": "4",
    "department": "Biological Sciences",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "preclusion": "SSS1207",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-06T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1023",
    "title": "Representing Singapore",
    "description": "While drawing on methodologies and approaches used in literary studies, this module moves beyond the traditional confines of Singapore Literature. We will thus examine the representation of Singapore, and of contemporary issues of importance in Singapore, in a variety of different popular media. After an initial introduction to the critical reading of cultural representation, we will explore traditional genres such as poetry and drama, as well as more popular ones such as television, film, and popular autobiography. The module is open to all students.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "SSA1206",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GES1024",
    "title": "Real Estate Development & Investment Law",
    "description": "This Module introduces students to the law pertaining to real estate development and investment in Singapore. Students will acquire an understanding and appreciation of the policies, circumstances and legal principles which underpin and shape the law on the availability, ownership, development and usage of real estate in Singapore. Students will also gain insight into legal analysis and modes of legal reasoning. This module is targeted at all students across Faculties who have had no exposure to Real Estate Law and wish to acquire a broad understanding of the multiple legal issues that pertain to the built environment.",
    "moduleCredit": "4",
    "department": "Real Estate",
    "faculty": "Design and Environment",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "SSD1203",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-30T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1025",
    "title": "Singapore Literature in English: Selected Texts",
    "description": "This module will focus on Singapore literature in English. It will deal with selected texts in the three main genres: poetry, fiction and drama. There will\nalso be opportunities to discuss the works with the writers. One of its main aims is to show how literature will help us gain a more comprehensive\ninsight into our understanding of Singapore.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      1,
      3,
      3
    ],
    "preclusion": "SSA1207, SSA1207FC",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-06T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1026",
    "title": "Urban Planning in Singapore",
    "description": "This module aims to give students an understanding of the nature of urban planning, basic planning models and theories. Urban planning will be discussed, in the context of urbanisation and globalisation, as an important force shaping the modern human settlements. A study of the institutional aspect of planning will relate to Singapore’s planning system in which issues of planning implementation will be elaborated. Learning objectives: Understanding nature of urban planning; understanding urban planning processes; understanding urban planning principles. Major topics to be covered: Urbanisation history and its impact; Urban forms: organic growth of urban settlements; Utopian city/the garden city movement; The city beautiful movement/ Neighbourhood; New town; Urban design and conservation; Institutional Structure for planning; Concept Plan and Master Plan; Development control/planning implementation; Planning analysis: population and transportation; Public participation in planning.",
    "moduleCredit": "4",
    "department": "Real Estate",
    "faculty": "Design and Environment",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEK2005",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1028",
    "title": "Singapore Society",
    "description": "In this module, we seek to reflect on some taken-for-granted understandings of “Singapore society” and to dialogue with the readings, lectures and tutorial materials. We hope you will be able to appreciate the diverse social, political, historical processes and legacies, problems and contradictions that have constructed Singapore society. Ultimately, we aim to equip you with varied viewpoints that will enable you to think critically about Singapore society, its past, its present and its future.",
    "moduleCredit": "4",
    "department": "Sociology",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "SSA1201",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-28T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-30T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1029",
    "title": "Singapore Film: Performance of Identity",
    "description": "This module explores the ways in which Singapore films constitute a national cinema by considering the history and development of local film production as well as closely examining how individual films perform and engage the notion of a Singapore identity. Through a group creative project, students are challenged to make their own Singapore film that involves the practical application of critical ideas and enables students to participate in the ways that a national cinema performs and functions. The films studied may involve mature content and have varied film ratings.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "SSA2218, TS2238",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GES1031",
    "title": "Culture and Communication in Singapore",
    "description": "This module introduces students to essential concepts in\ncommunication within and across different cultures and\nprepares them to meet the needs and challenges living\nand communicating in Singapore’s multiracial and\nmulticultural environment. It covers a broad range of\ntopics that include cultural perception, cultural\nrelativism, cultural patterns and worldviews, and verbal\nand nonverbal communication. Applied topics in\nintercultural communication to business and\norganization, media and technology, and computer-mediated\ncommunication are also covered against the\nbackdrop of Singapore’s digitally-networked and\nglobalized economy. Students will learn to be\ninterculturally sensitive and competent communicators\nas global citizens and citizens in a global city-state.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-05T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-07T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1033",
    "title": "Who moved my OB markers?",
    "description": "This module examines the topic of censorship in\nSingapore. It examines the origins and meaning of the\nterm “OB marker” and Singapore’s history of regulating\nmedia and speech to contextualise the perception of\nstrict state control on speech. Contemporary events\nrelated to speech and expression are critically\nexamined to assess if the perception of strict state\ncontrols on speech in Singapore is still valid.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-03T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-04-27T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1034",
    "title": "We the Citizens - Understanding Singapore’s Politics",
    "description": "The module initiates students into the workings of\npolitics from the perspective of citizenship. What\nconstitutes citizenship? What are the roles, duties and\nobligations of being a Singapore citizen? How do\ncitizens interact and impact politics and decision\nmaking in Singapore? How have changes over the\nyears, including (a) perspective of Singapore’s political\nhistory, (b) imperatives shaping national politics, (c) the\npolitical system, (d) its key structures and approaches\nto nation building, affected national politics and in turn,\nled to the political elites responding to changing\ndemands of citizens? The role of civic and civil society\nwill also be discussed.",
    "moduleCredit": "4",
    "department": "Political Science",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-06T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GES1035",
    "title": "Singapore: Imagining the Next 50 Years",
    "description": "As   an   economically-developed   nation   with  a  diverse   population,    Singapore  now  confronts a range  of   socioeconomic  issues,   a  rapidly  ageing    population,   declining  fertility  rates,  widening  income  inequality,  and  rising  living  costs  amidst  increasing  global  competition,  technological    advancements,  and  security    threats.  Singaporeans  have  also  become  a  people  with  a  greater  propensity  to  participate  in  the  decisions  that  affect  the  nation. This module aims to encourage undergraduates to reflect   on   Singapore’s    post-independence    history,   imagine  the  kind  of  Singapore  they  would  like  to  co-create, and deliberate on the ways to achieve the future visions   they   have   for   Singapore.  All  lectures  will be mounted online.",
    "moduleCredit": "4",
    "department": "Sociology",
    "faculty": "Arts and Social Science",
    "workload": [
      1,
      1,
      0,
      3,
      5
    ],
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GES1037",
    "title": "A History of Singapore in Ten Objects",
    "description": "This module facilitates an introductory inquiry into Singaporean pasts based on a cache of 'objects', broadly defined. Students will be invited to make critical\nobservations and bring to bear their imaginations on a variety of 'objects' from Singapore’s pasts: sand, well, club, movie and sound card, among others. Students will then exercise their historical imaginations to generate interpretive possibilities pertaining to Singapore's past prompted by these objects, both individually and collectively. In reflecting on these objects and their possible connections to the past, students will emerge from this module with a broad, diverse, creative and concrete grasp of Singapore's histories.",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2.5,
      4.5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 4
      }
    ]
  },
  {
    "moduleCode": "GES1039",
    "title": "Cultural Performances and Practices in Singapore",
    "description": "This module introduces a broad spectrum of performance practices that may be identified as local cultural expressions found in Singapore. Such practices occur in varied spaces and mediums, and include street opera, getai [song-stage], animal performances, theatre, film, religious festivals, national day parades, YouTube video performances and mobile gaming. Students will explore the rich performative histories of these practices and study concepts of performativity, liveness, and mediation. They will learn the ways in which technology and media play a crucial part in cultural expression and identity formation. The module is open to all students and Continuous Assessment is 100%.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GES1041",
    "title": "Everyday Ethics in Singapore",
    "description": "This module examines the ethical dimensions of\neveryday life in Singapore. It focuses on moral\ndilemmas that arise in the nation’s pursuit of\n‘happiness, prosperity, and progress’. We will explore\nhow moral reasoning from multiple perspectives\napplies to local concerns such as equality, meritocracy,\nmulticulturalism, immigration, and marriage. This will\nchallenge us to identify moral problems created by\nsocial and technological changes, combine ethical\nprinciples with practical constraints, and balance the\ninterests of individuals and communities. We will also\nconsider how moral dialogue can be cultivated in\nSingapore’s multicultural society, so as to manage\ndiverse traditions and divergent values.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2.5,
      4.5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-27T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1001",
    "title": "Seeing the World Through Maps",
    "description": "In general, this module is aimed at getting student to critically engage with the ‘work’ or ‘power’ of maps in shaping the historical emergence of the modern world and in its ongoing transformation. To do this we will combine diverse modes of learning, covering issues of knowledge and content (the history of cartography), practical skills of map making/reading, and critical skills of evaluating and interpreting maps. We will stimulate a critical awareness of mapping as an evolving technology that has far-reaching social and political considerations.",
    "moduleCredit": "4",
    "department": "Geography",
    "faculty": "Arts and Social Science",
    "preclusion": "GEK1037",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-02T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1002",
    "title": "Bridging East and West: Exploring Chinese Communication",
    "description": "This module offers NUS students an opportunity to explore different aspects and contexts of Chinese communication. The target audience is English speaking undergraduates with minimal Chinese language proficiency. The various contexts of Chinese communication include advertising, business, the press, social communication, regional usages, pop culture, translations, meaning of Chinese names, codeswitching and the use of Chinese dialects. It is intended to serve as a primer for students interested in these areas of study. A minimum Chinese language proficiency of CLB is required.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEK1062",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GET1003",
    "title": "Home",
    "description": "Few words in the English language (or any language) are as evocative and emotionally‐charged as “home.” But how do we determine what we call home, and why should we take “home” seriously? This module explores the political, social, economic, and cultural aspects of the complex idea of home. Major topics include: sense of place, home technologies and design, gender and housework, home and travel, globalisation,\nnationalism, homelessness, exile, and representations of home. Students will complete the module with a new appreciation for the complexity of the places – house, neighborhood, nation, planet – they call home.",
    "moduleCredit": "4",
    "department": "Japanese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEM1046",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-04T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1004",
    "title": "Cyber Security",
    "description": "The Internet has become the most widely used medium for commerce and communication as its infrastructure can be quickly and easily set up to link to the worldwide network and access information globally. Its growth over the last few years has been phenomenal. With these activities, countries are beginning to recognize that this new technology can not only expand the reach and power of traditional crimes, but also breed new forms of criminal activity. \n\n\n\nOn the successful completion of this module, students should gain sufficient baseline knowledge to be able to identify, assess and respond to a variety of cybercrime scenarios, including industrial espionage, cyber-terrorism, communications eavesdropping, computer hacking, software viruses, denial-of-service, destruction and modification of data, distortion and fabrication of information, forgery, control and disruption of information. \n\n\n\nStudents will also learn about countermeasures, including authentication, encryption, auditing, monitoring, technology risk management, intrusion detection, and firewalls, and the limitations of these countermeasures.",
    "moduleCredit": "4",
    "department": "Mathematics",
    "faculty": "Science",
    "preclusion": "GEK1531",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1008",
    "title": "Public Speaking and Critical Reasoning",
    "description": "This module prepares students to be effective and efficient public speakers. It offers an overview of the theories of oral communication and public speaking, with particular emphasis on effective speaking, listening and critique skills. It looks into adapting evidence, language, visual aids and other message characteristics through selected forms of public speaking for various purposes, audiences and contexts and includes practice in the critical analysis of speeches. It emphasizes strategic communication to enhance critical thinking skills, rhetorical fluency through reasoned thinking and expression of logical argument positions on local and global issues that impact our everyday lives.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      1,
      2,
      0,
      2,
      5
    ],
    "preclusion": "GEM2027",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1009",
    "title": "Gandhi's Life, Thought And Legacy",
    "description": "This module will primarily examine the life and writings of Mohandas Karamchand Gandhi, widely regarded as one of the icons of the twentieth century and one of the principal architects of a free India. The course is meant to not only understand and analyse Gandhi’s thought but also to outline his extraordinary legacy. The course will develop critical thinking and expression of students in two ways. First, it will introduce students to and make them critically engage with Gandhi’s writings and ideas on several issues, including violence and conflict resolution, colonialism, modernity, ethics, science, health and environment. The aim would be to not only expose students to the complexity of Gandhi — the man and his ideas — but to critically interrogate Gandhi and his legacies. Gandhi is particularly suited to such an exercise since he held positions that were often controversial and counter-intuitive, both during his lifetime as well as today.  Second, the students will develop their expression skills, verbal and written, by evaluating Gandhi and his legacy through presentations, take-home assignments and examinations. The students will develop their thinking and expression skills through an analysis not only of texts but also of films and documentaries on Gandhi.",
    "moduleCredit": "4",
    "department": "South Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "GEK1048",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-04T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1011",
    "title": "Towards an Understanding of the Complex World",
    "description": "What do natural resources utilization, spread of diseases and urbanization have in common? Why do economic, social and health systems behave the way they do? Students will explore these questions through the systems and critical thinking paradigm. Through collaborative work and classroom debates, students will expand and consolidate knowledge fragments into structured representations for larger, complex systems. By deciphering common motifs, and understanding the effect of interdependencies between the different parts of the system, students will develop critical stances about real-world phenomena. They will express their understanding of the structure and behavior of systems through multimedia reports and oral presentations.",
    "moduleCredit": "4",
    "department": "Chemical and Biomolecular Engineering",
    "faculty": "Engineering",
    "workload": [
      1,
      1,
      0,
      4,
      4
    ],
    "preclusion": "GEM1912 Jnr Sem: Systems Systems Everywhere (offered at CAPT, UTown)\n\nDespite the minimal overlap, the preclusion may be needed to ensure that students who have completed GEM1912 do not have an unfair starting advantage over others who take this module.\n\nGEM1915",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-29T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1013",
    "title": "Physics in the Life Sciences",
    "description": "Life science is the science that deals with phenomena regarding living organisms. It includes branches such as biology, medicine, anthropology and ecology. Physics on the other hand, studies the fundamental relationship between matter, energy, space, and time. Many people may consider them to be in different regimes and require different mindsets to work on. But as both disciplines advanced, it became increasingly clear that the interactions between them are far more pervasive and fundamental than one might expect. For example, the field of biophysics has risen since the 1950s, and it has vastly changed how biologists look at living systems or study biology. It proved that the mindsets of biology and physics can join together to provide deeper insight into the phenomenon we call life. We will base the material on the basic laws of physics, and discuss how they are interwined with all kinds of life science and daily life phenomena, from cells to ecosystems and from Earth to outer space. Through reading this module, the students would be able to think deeper about the daily phenomena around them, and understand better the foundation of life on Earth.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2.5,
      0.5,
      0,
      3,
      4
    ],
    "preclusion": "GEK1521",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GET1014",
    "title": "The Art of Science, the Science of Art",
    "description": "It often seems the worlds of science and art are unrelated: Logical truth versus emotional imagination. Still, science and art have much in common. Science has caused paradigm shifts in artistic expression while art is used for engineering design and communication of scientific knowledge. In this module, students will be introduced to the use of materials and technology related to architecture, sculpture, painting, photography and imaging. The use of technology for dating and attribution of objects of art  as well as the use of visual art for scientific illustration and design will be examined. Knowledge of the scientific principles of various forms of visual art will also be explored. The module aims at the development of some artistic skills for illustrations of scientific concepts and engineering designs. This module will help students to better express their thoughts through artistic expression and appreciate visual art.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "preclusion": "GEK1547",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1016",
    "title": "Understanding the Changing Global Economic Landscape",
    "description": "Why and how have things changed and moved so fast? Why and how has the global economy become more open and integrated? This module discusses the increasing connections and mobilities of goods (like grains, oil, cars, appliances, parts & components), services (like banking, education, tourism), money and finance, labour, technology, ideas and information. It discusses their trends and patterns and critically examines the role of various factors such as international and regional institutions, media and ICT, infrastructure and distribution networks, state intervention, and private sector involvement. It also assesses the social, economic, political and environmental impacts of increasing interconnectedness and mobilities.",
    "moduleCredit": "4",
    "department": "Southeast Asian Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEM1052",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-01T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1016T",
    "title": "Understanding The Changing Global Economic Landscape",
    "description": "Why and how have things changed and moved so fast? Why and how has the global economy become more open and integrated? This module discusses the increasing connections and mobilities of goods (like grains, oil, cars, appliances, parts & components), services (like banking, education, tourism), money and finance, labour, technology, ideas and information. It discusses their trends and patterns and critically examines the role of various factors such as international and regional institutions, media and ICT, infrastructure and distribution networks, state intervention, and private sector involvement. It also assesses the social, economic, political and environmental impacts of increasing interconnectedness and mobilities.",
    "moduleCredit": "4",
    "department": "SCALE Dean's Office",
    "faculty": "Cont and Lifelong Education",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "preclusion": "GEM1052, GET1016",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 3,
        "examDate": "2019-07-13T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1018",
    "title": "The Mathematics of Games",
    "description": "Games being a form of human activities since antiquity are often played with strategies that require critical thinking and decision making. Many of the number games like the game of nim have a rich mathematics favour. Real life social games contain combinatorial and probabilistic strategies. Simple economic activities can also be modelled in terms of games.  In this module, selected real-life social games are discussed and treated in ways that bring out their mathematical creativity. The objective is to let students gain an appreciation of mathematics, its beauty and applications through the discussion of some of these games. In particular, we give an introduction of elementary non-zero sum and non-cooperative game as developed by von Neumann and Nash.",
    "moduleCredit": "4",
    "department": "Mathematics",
    "faculty": "Science",
    "workload": [
      3,
      1,
      0,
      0,
      6
    ],
    "preclusion": "GEK1544",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-08T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1019",
    "title": "Patrons of the Arts",
    "description": "This course is a conceptual and practical introduction to the complex networks that drive \"patronage,\" including multifarious kinds of patronage. Issues raised and debated include exploring money, religion, politics, social classes, and many other social constructs that influence what art people support, and why they, especially you, support different kinds of art. Students will need to grasp and evaluate critically each set of issues that drive and affect patronage of the arts, and demonstrate their critical understanding of the interplay of these factors through written assessments, classroom discussions, and contributions to blog postings related to the module materials.",
    "moduleCredit": "4",
    "department": "YSTCM Dean's Office",
    "faculty": "YST Conservatory of Music",
    "workload": [
      0,
      2,
      0,
      4,
      4
    ],
    "preclusion": "GEM1029, MUL2102",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GET1020",
    "title": "Darwin and Evolution",
    "description": "Charles Darwin is remembered like no other figure in the history of science. However, public understanding of Darwin and evolution remains a serious problem. What most people think they know about Darwin, his life and his famous book ‘On the origin of species’ is wrong. This module provides a solid background for understanding how the theory of evolution actually unfolded. It covers the history of geology, palaeontology and biology from the 1700s to the 20th century. The central focus is on the life and work of Charles Darwin and how biological evolution was uncovered, debated and accepted by the international scientific community in the 19th century, and beyond. There will be a lot of myth busting and this provides case studies on how to assess historical claims and evidence, and discussions on recent developments in evolutionary biology, human evolution and anthropology are included.",
    "moduleCredit": "4",
    "department": "Biological Sciences",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "preclusion": "GEM1902B Junior Seminar: The Darwinian Revolution. GEM1536",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-04T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1021",
    "title": "Critical Thinking And Writing",
    "description": "The challenges of a global engineer increasingly call upon engineers to think critically and communicate effectively to undertake developmental\nleadership. This course aims to develop and practise students’ critical thinking and writing skills through analysing case studies in engineering leadership, constructing complex engineering-related problems and solutions, presenting arguments effectively and reflecting on personal leadership development. Relevance to engineering practice is emphasized with references to grounded theories of engineering leadership (Colcleugh, 2013; Rottman, Sacks & Reeve, 2015) and the seven missing basics of engineering education (Goldberg, 2009).",
    "moduleCredit": "4",
    "department": "Center for Engl Lang Comms",
    "faculty": "NUS",
    "workload": [
      1.5,
      2,
      0,
      4,
      2.5
    ],
    "prerequisite": "- Students who are required to read ES1000 and/or EAP modules ES1102 must pass it/them before taking GET1021. \n\n-Only students matriculated in AY2015/2016, are allowed to take GET1021.",
    "preclusion": "IEM1201%, UTW1001%, GET1006, ES1531/GEK1549. U-town students cannot bid for GET1021.",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1022",
    "title": "Understanding Your Brain",
    "description": "This module will explore how our brain can affect our behavior. It will introduce how classical and modern neuroscience research tools are used to investigate the working of the brain. We will also examine the ethical and social issues raised by recent developments in neuroscience research. In addition, this module is expected to enable students to develop critical skills in analysizing and writing controversial issues concerning neuroscience and society.",
    "moduleCredit": "4",
    "department": "Physiology",
    "faculty": "Yong Loo Lin School (Medicine)",
    "workload": [
      2,
      2,
      0,
      0,
      6
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-03T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1023",
    "title": "Thinking Like An Economist",
    "description": "This module aims to explain human behaviour through the lens of economists. We use economic reasoning to answer questions as diverse as the following: Why would your teacher cheat? Which factors cause crime rates to go down? Why do countries fail sometimes? We use texts that popularize economic concepts to illustrate how different social phenomena can be understood by applying the tools of economic analysis. However, we also discuss possible limitations of the economic approach to social issues. In this course we review, challenge, and debate on firmly established ideas we all have about the world, our society, and ourselves.",
    "moduleCredit": "4",
    "department": "Economics",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-04T05:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-06T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1024",
    "title": "Radiation-Scientific Understanding and Public Perception",
    "description": "This module aims to equip students with the essential knowledge to make intelligent assessments on the potential risks and uses of radiation in our modern society. After introducing the physics behind various forms of radiation, we will look at how these radiations are used in medical diagnosis and treatment and other applications. Some controversial issues in these applications will be raised and debated. The health effects of high and low levels of radiation will be presented based on scientific evidence thus dispelling some of the negative misconceptions of radiation and irrational fear of it. The social and political dynamics in electricity generation through nuclear power plants in various countries will also be discussed.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      3,
      0.5,
      0.5,
      1.5,
      4.5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1025",
    "title": "Science Fiction and Philosophy",
    "description": "This module considers science fiction as a mode of philosophical inquiry. Science fiction stories are used to examine fundamental questions of metaphysics,\nepistemology and ethics. Topics include the nature of time, space, religion, nature, mind, and the future. Specific topics may include such issues as genetic enhancement, environmental ethics, and implications of encounters with non‐human life forms.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "GEK2041",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GET1026",
    "title": "Effective Reasoning",
    "description": "What is good reasoning? We will try to answer this question by studying the mechanics of reasoning. Students will learn what an argument is, what the difference between validity and soundness is, and what it means to say that an argument is valid in virtue of its form. They will also be introduced to various strategies and pitfalls in reasoning. In addition, to hone their analytical skills, students will be given arguments—drawn from philosophy and other areas—to unpack and evaluate. It is hoped that in the process of learning what counts as good reasoning, one will become a better reasoner.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "GEK2048",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1027",
    "title": "Reason and Persuasion",
    "description": "For the first six weeks, students read three dialogues by the ancient Greek philosopher, Plato: Euthyphro, Meno, and Republic, Book I. These readings touch on a wide range of topics: mind and morals; politics and psychology; metaphysics and science. For the second six weeks, students will meet with the same problems, ideas and arguments, but as they manifest in the writings of various contemporary figures – philosophers and non-philosophers: psychologists, political scientists, public policy experts. \n\n‘Reason and Persuasion’ is a generic title. But it indicates a specific concern. Reason without persuasion is useless; persuasion without reason is dangerous. Plato worried about this; so will we.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      3,
      1,
      0,
      2,
      4
    ],
    "preclusion": "GEM1004",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-08T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1028",
    "title": "Logic",
    "description": "An introduction to classical logic. The first half of the course introduces propositional logic, using the techniques of truth-tables and linear proof by contradiction. The second half of the course extends the use of linear proof by contradiction to predicate logic. Emphasis is placed on applying the techniques to philosophical arguments.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "PH2110, CS3234, MA4207, GEM2006",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-04-30T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1029",
    "title": "Life, the Universe, and Everything",
    "description": "This module offers an opportunity to grapple with some of the most enduring challenges to human thought. Our starting point is a conception of ourselves as free and conscious beings equipped with bodies that allow us to observe and explore a familiar external world. Successive lectures investigate alternative conceptions of the human condition, such as ones in which we are unfree, or non-spirituous, or inhabit a world whose fundamental nature is hidden from our view. Different conceptions bear differently on the further question of what we should value and why. Discussion is both argument-driven and historically informed.",
    "moduleCredit": "4",
    "department": "Philosophy",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      0,
      7
    ],
    "preclusion": "PH1102E, GEK1067",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-26T09:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-04T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1030",
    "title": "Digital Humanities in Arts Research",
    "description": "Digital technologies let us do humanities differently, using interactive publishing, machine-driven analysis, media-rich platforms, online archives and crowd-sourced databases. How are these technologies changing the humanities? This module invites students from across the university to consider this question through a problem-based approach. In each session, the students will learn to use and critically evaluate digital tools and platforms. Reflecting the multiple approaches within the digital humanities, teaching combines seminar discussions of topics with hands-on training in web programming, text encoding and video processing techniques.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      0.5,
      0.5,
      0,
      7
    ],
    "preclusion": "GEK2050",
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1031A",
    "title": "Computational Thinking",
    "description": "Computational thinking (CT) is an important 21st century skill and a fundamental method for solving complex problems. CT involves problem formulation, abstraction, decomposition, pattern recognition, and algorithm design. This module emphasizes the thinking process, and the communication and substantiation of the process, rather than focusing on coding. Students learn to apply CT to understand and solve everyday problems within and across disciples. Students learn to leverage on CT to ask new questions, to formulate new problems, and develop new solutions.",
    "moduleCredit": "4",
    "department": "Office of Sr Dy Pres and Provost",
    "faculty": "NUS",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1032",
    "title": "Building Relationship : Theories and Practice",
    "description": "This module critically examines theoretical issues and applications of effective interpersonal communication in enhancing interpersonal relationship building. The content will include various theoretical frameworks, models and issues related to interpersonal communication. It will also introduce module participants to interpersonal practice in dealing with diverse individuals. Experiential learning methods will be used in tutorial groups to develop critical thinking abilities on relationship building issues, and to translate the thinking abilities into interpersonal practice using case study, role play and reflection.",
    "moduleCredit": "4",
    "department": "Social Work",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-04T09:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1033",
    "title": "Exploring Computational Media Literacy",
    "description": "This module explores how the computer can be used as a medium for expression. Just as it is essential to be literate in the traditional sense, it is increasingly important to be literate (able to read and write) in computational media, such as webpages, social media, smartphone apps, computer games, etc. Through a balance of theory and practice, this interdisciplinary module exposes students to the history and principles behind computation. Students learn, through hands-on exercises, the ways that computation underpins key\naspects of modern life, such as the internet, mediated communication, business and commerce, science and technology, and the arts.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      2,
      0,
      4,
      2
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GET1034",
    "title": "Communication and Critical Thinking for Community Leadership",
    "description": "This critical thinking and communication module provides an opportunity for students to explore community leadership within an interdisciplinary environment. In particular, through understanding the constructivist theory of communication (Burleson, 2007) and Paul and Elder’s (2014) critical thinking framework, this module will facilitate the development of deliberative and active citizenry among students, regardless of the position they hold in the community. Students will apply these concepts individually to short case studies and reflections. They will then use these short assignments to conceptualize team projects relevant to their respective community settings.",
    "moduleCredit": "4",
    "department": "Center for Engl Lang Comms",
    "faculty": "NUS",
    "workload": [
      1.5,
      2,
      0,
      4,
      2.5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1035",
    "title": "Critical Perspectives in Advertising",
    "description": "This module critiques the effects of advertising.\nSpecifically, it deconstructs the role of advertising as\npracticed by commercial, non-commercial and a variety\nof other entities to persuade us to adopt products,\nservices, ideas, and ideologies. In doing so, we highlight\nnegative and positive advertising effects from\ncommunicative, psychological, cultural, sociological, and\npolitical perspectives. Various social and ethical\nimplications of advertising on society in general, and on\nvarious vulnerable populations, such as children,\nminorities, and women, in particular are also discussed.\nThe module promotes approaches to manage advertising\ninfluences through active citizen participation to achieve\na more enlightened society.",
    "moduleCredit": "4",
    "department": "Communications and New Media",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      4,
      3
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-12-06T01:00:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-08T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1036",
    "title": "The Logic of Language",
    "description": "Our capacity for language is a defining aspect of what it means to be human and is central to both thought and communication. This course investigates the rules that underlie what we say, how meaning is encoded, and how we reason with language. We will apply mathematical tools of pattern description and logic to describe and better understand human language, with the goal of developing logical explanations for linguistic phenomena. Comparison to artificial and programming languages will be discussed. Emphasis will be placed on clear, precise descriptions and their accessible communication through writing and oral presentation.",
    "moduleCredit": "4",
    "department": "English Language and Literature",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2,
        "examDate": "2019-05-08T05:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1037",
    "title": "Big Picture History",
    "description": "This module discusses ‘big picture’ History by considering defined themes that range across time and space. The focus is not on individual societies or\ntime periods, but on questions related to commonalities in developments across all societies. This approach is like looking at a painting from a\ndistance instead of at the brush strokes that constitute it, and will lead to questions about what human activities and experiences constitute the global\nexperience. As part of the Thinking and Expression pillar, this module will help students think historically and also critically engage the maxim that ‘the past is a foreign country.’",
    "moduleCredit": "4",
    "department": "History",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      1,
      6
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1,
        "examDate": "2018-11-30T06:30:00.000Z",
        "examDuration": 120
      },
      {
        "semester": 2,
        "examDate": "2019-05-03T01:00:00.000Z",
        "examDuration": 120
      }
    ]
  },
  {
    "moduleCode": "GET1039",
    "title": "What, When and Where is Art?",
    "description": "This course explores the arts through three different, but overlapping, questions: What is art? (including the polemics associated with this question), When is art? (i.e. creations that are interpreted as art, or not art, at different times), and Where is art?\n(i.e. why something is perceived as art when it is in one setting, but is generally otherwise unnoticed). Visits to Singapore locations for case studies are required. Students will study and apply several disparate theories, and will also write their own.",
    "moduleCredit": "4",
    "department": "YSTCM Dean's Office",
    "faculty": "YST Conservatory of Music",
    "workload": [
      2,
      0,
      0,
      4,
      4
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1042",
    "title": "Sky and Telescopes",
    "description": "The objective of this module is to foster an appreciation of the natural beauty of the night sky. In this module, students will learn how to conduct their own astronomical observations and relate that experience to the various modes of thinking and philosophy behind astronomy and astrophysics. Students will also have the  opportunity to communicate their experiences and ideas with their peers and a wider audience.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      3,
      1,
      0,
      3,
      3
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      },
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1043",
    "title": "Universe, Big Bang, and Unsolved Mysteries",
    "description": "In this module, students will explore the universe, its contents, properties, evolution, and origin. Major topics to be covered include ideas and concepts of the universe, astronomical observations, scientific models, big bang theory, and unsolved problems in cosmology.",
    "moduleCredit": "4",
    "department": "Physics",
    "faculty": "Science",
    "workload": [
      2,
      1,
      0,
      3,
      4
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 1
      }
    ]
  },
  {
    "moduleCode": "GET1046",
    "title": "I Do Not Think Therefore I Am",
    "description": "This module aims to call attention to the fundamental importance of thinking not only in learning per se but also in shaping who we are. It examines the nature of thinking, as well as its mechanisms. It aims to help students experience the excitement of thinking as they try to understand what thinking is; students are thus compelled to critique and re-examine their own assumptions about what they think they know and about themselves as psychosomatic learners and persons.",
    "moduleCredit": "4",
    "department": "Chinese Studies",
    "faculty": "Arts and Social Science",
    "workload": [
      2,
      1,
      0,
      2,
      5
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  },
  {
    "moduleCode": "GET1048",
    "title": "Science: From Thinking to Narratives",
    "description": "This module approaches science as a mode of thinking and a process of knowing; and examines how the thinking and process generated narratives (stories) about our natural world, life and ourselves. It also explores other controversial and darker narratives of pseudoscience and fraudulent science that arose from the deviation and the misuse/abuse of the thinking and the process of science. It highlights how these narratives ignited imaginations and aroused ethical and societal concerns. Students will learn how science through its thinking and process have generated narratives, and in turn how these narratives have\nchanged our thinking and beyond.",
    "moduleCredit": "4",
    "department": "Biological Sciences",
    "faculty": "Science",
    "workload": [
      4,
      0,
      0,
      4,
      2
    ],
    "attributes": {
      "su": true
    },
    "semesterData": [
      {
        "semester": 2
      }
    ]
  }
]
